/* automatically generated by rust-bindgen */

pub const VULKAN_H_: ::std::os::raw::c_uint = 1;
pub const VK_VERSION_1_0: ::std::os::raw::c_uint = 1;
pub const _STDINT_H: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC11: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC99: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC95: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const __USE_POSIX: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX2: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199309: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199506: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K8: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_MISC: ::std::os::raw::c_uint = 1;
pub const __USE_ATFILE: ::std::os::raw::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::std::os::raw::c_uint = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: ::std::os::raw::c_uint = 0;
pub const _STDC_PREDEF_H: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559__: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559_COMPLEX__: ::std::os::raw::c_uint = 1;
pub const __STDC_ISO_10646__: ::std::os::raw::c_uint = 201706;

          =
    b"VK_EXT_sampler_filter_minmax\x00";
pub const VK_AMD_gpu_shader_int16: ::std::os::raw::c_uint = 1;
pub const VK_AMD_GPU_SHADER_INT16_SPEC_VERSION: ::std::os::raw::c_uint = 1;
pub const VK_AMD_GPU_SHADER_INT16_EXTENSION_NAME: &'static [u8; 24usize] =
    b"VK_AMD_gpu_shader_int16\x00";
pub const VK_AMD_mixed_attachment_samples: ::std::os::raw::c_uint = 1;
pub const VK_AMD_MIXED_ATTACHMENT_SAMPLES_SPEC_VERSION: ::std::os::raw::c_uint
          =
    1;
pub const VK_AMD_MIXED_ATTACHMENT_SAMPLES_EXTENSION_NAME:
          &'static [u8; 32usize] =
    b"VK_AMD_mixed_attachment_samples\x00";
pub const VK_EXT_shader_stencil_export: ::std::os::raw::c_uint = 1;
pub const VK_EXT_SHADER_STENCIL_EXPORT_SPEC_VERSION: ::std::os::raw::c_uint =
    1;
pub const VK_EXT_SHADER_STENCIL_EXPORT_EXTENSION_NAME: &'static [u8; 29usize]
          =
    b"VK_EXT_shader_stencil_export\x00";
pub const VK_EXT_blend_operation_advanced: ::std::os::raw::c_uint = 1;
pub const VK_EXT_BLEND_OPERATION_ADVANCED_SPEC_VERSION: ::std::os::raw::c_uint
          =
    2;
pub const VK_EXT_BLEND_OPERATION_ADVANCED_EXTENSION_NAME:
          &'static [u8; 32usize] =
    b"VK_EXT_blend_operation_advanced\x00";
pub const VK_NV_fragment_coverage_to_color: ::std::os::raw::c_uint = 1;
pub const VK_NV_FRAGMENT_COVERAGE_TO_COLOR_SPEC_VERSION:
          ::std::os::raw::c_uint =
    1;
pub const VK_NV_FRAGMENT_COVERAGE_TO_COLOR_EXTENSION_NAME:
          &'static [u8; 33usize] =
    b"VK_NV_fragment_coverage_to_color\x00";
pub const VK_NV_framebuffer_mixed_samples: ::std::os::raw::c_uint = 1;
pub const VK_NV_FRAMEBUFFER_MIXED_SAMPLES_SPEC_VERSION: ::std::os::raw::c_uint
          =
    1;
pub const VK_NV_FRAMEBUFFER_MIXED_SAMPLES_EXTENSION_NAME:
          &'static [u8; 32usize] =
    b"VK_NV_framebuffer_mixed_samples\x00";
pub const VK_NV_fill_rectangle: ::std::os::raw::c_uint = 1;
pub const VK_NV_FILL_RECTANGLE_SPEC_VERSION: ::std::os::raw::c_uint = 1;
pub const VK_NV_FILL_RECTANGLE_EXTENSION_NAME: &'static [u8; 21usize] =
    b"VK_NV_fill_rectangle\x00";
pub const VK_EXT_post_depth_coverage: ::std::os::raw::c_uint = 1;
pub const VK_EXT_POST_DEPTH_COVERAGE_SPEC_VERSION: ::std::os::raw::c_uint = 1;
pub const VK_EXT_POST_DEPTH_COVERAGE_EXTENSION_NAME: &'static [u8; 27usize] =
    b"VK_EXT_post_depth_coverage\x00";
pub const VK_EXT_shader_viewport_index_layer: ::std::os::raw::c_uint = 1;
pub const VK_EXT_SHADER_VIEWPORT_INDEX_LAYER_SPEC_VERSION:
          ::std::os::raw::c_uint =
    1;
pub const VK_EXT_SHADER_VIEWPORT_INDEX_LAYER_EXTENSION_NAME:
          &'static [u8; 35usize] =
    b"VK_EXT_shader_viewport_index_layer\x00";
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(::std::mem::size_of::<max_align_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( max_align_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) .
                __clang_max_align_nonce1 as * const _ as usize } , 0usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __clang_max_align_nonce1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) .
                __clang_max_align_nonce2 as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __clang_max_align_nonce2 ) ));
}
impl Clone for max_align_t {
    fn clone(&self) -> Self { *self }
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type VkFlags = u32;
pub type VkBool32 = u32;
pub type VkDeviceSize = u64;
pub type VkSampleMask = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkInstance_T {
    _unused: [u8; 0],
}
pub type VkInstance = *mut VkInstance_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPhysicalDevice_T {
    _unused: [u8; 0],
}
pub type VkPhysicalDevice = *mut VkPhysicalDevice_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDevice_T {
    _unused: [u8; 0],
}
pub type VkDevice = *mut VkDevice_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkQueue_T {
    _unused: [u8; 0],
}
pub type VkQueue = *mut VkQueue_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSemaphore_T {
    _unused: [u8; 0],
}
pub type VkSemaphore = *mut VkSemaphore_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkCommandBuffer_T {
    _unused: [u8; 0],
}
pub type VkCommandBuffer = *mut VkCommandBuffer_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkFence_T {
    _unused: [u8; 0],
}
pub type VkFence = *mut VkFence_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDeviceMemory_T {
    _unused: [u8; 0],
}
pub type VkDeviceMemory = *mut VkDeviceMemory_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBuffer_T {
    _unused: [u8; 0],
}
pub type VkBuffer = *mut VkBuffer_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkImage_T {
    _unused: [u8; 0],
}
pub type VkImage = *mut VkImage_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkEvent_T {
    _unused: [u8; 0],
}
pub type VkEvent = *mut VkEvent_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkQueryPool_T {
    _unused: [u8; 0],
}
pub type VkQueryPool = *mut VkQueryPool_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBufferView_T {
    _unused: [u8; 0],
}
pub type VkBufferView = *mut VkBufferView_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkImageView_T {
    _unused: [u8; 0],
}
pub type VkImageView = *mut VkImageView_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkShaderModule_T {
    _unused: [u8; 0],
}
pub type VkShaderModule = *mut VkShaderModule_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPipelineCache_T {
    _unused: [u8; 0],
}
pub type VkPipelineCache = *mut VkPipelineCache_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPipelineLayout_T {
    _unused: [u8; 0],
}
pub type VkPipelineLayout = *mut VkPipelineLayout_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkRenderPass_T {
    _unused: [u8; 0],
}
pub type VkRenderPass = *mut VkRenderPass_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPipeline_T {
    _unused: [u8; 0],
}
pub type VkPipeline = *mut VkPipeline_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDescriptorSetLayout_T {
    _unused: [u8; 0],
}
pub type VkDescriptorSetLayout = *mut VkDescriptorSetLayout_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSampler_T {
    _unused: [u8; 0],
}
pub type VkSampler = *mut VkSampler_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDescriptorPool_T {
    _unused: [u8; 0],
}
pub type VkDescriptorPool = *mut VkDescriptorPool_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDescriptorSet_T {
    _unused: [u8; 0],
}
pub type VkDescriptorSet = *mut VkDescriptorSet_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkFramebuffer_T {
    _unused: [u8; 0],
}
pub type VkFramebuffer = *mut VkFramebuffer_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkCommandPool_T {
    _unused: [u8; 0],
}
pub type VkCommandPool = *mut VkCommandPool_T;
pub const VkPipelineCacheHeaderVersion_VK_PIPELINE_CACHE_HEADER_VERSION_BEGIN_RANGE:
          VkPipelineCacheHeaderVersion =
    VkPipelineCacheHeaderVersion::VK_PIPELINE_CACHE_HEADER_VERSION_ONE;
pub const VkPipelineCacheHeaderVersion_VK_PIPELINE_CACHE_HEADER_VERSION_END_RANGE:
          VkPipelineCacheHeaderVersion =
    VkPipelineCacheHeaderVersion::VK_PIPELINE_CACHE_HEADER_VERSION_ONE;
pub const VkPipelineCacheHeaderVersion_VK_PIPELINE_CACHE_HEADER_VERSION_RANGE_SIZE:
          VkPipelineCacheHeaderVersion =
    VkPipelineCacheHeaderVersion::VK_PIPELINE_CACHE_HEADER_VERSION_ONE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPipelineCacheHeaderVersion {
    VK_PIPELINE_CACHE_HEADER_VERSION_ONE = 1,
    VK_PIPELINE_CACHE_HEADER_VERSION_MAX_ENUM = 2147483647,
}
pub const VkResult_VK_RESULT_BEGIN_RANGE: VkResult =
    VkResult::VK_ERROR_FRAGMENTED_POOL;
pub const VkResult_VK_RESULT_END_RANGE: VkResult = VkResult::VK_INCOMPLETE;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkResult {
    VK_SUCCESS = 0,
    VK_NOT_READY = 1,
    VK_TIMEOUT = 2,
    VK_EVENT_SET = 3,
    VK_EVENT_RESET = 4,
    VK_INCOMPLETE = 5,
    VK_ERROR_OUT_OF_HOST_MEMORY = -1,
    VK_ERROR_OUT_OF_DEVICE_MEMORY = -2,
    VK_ERROR_INITIALIZATION_FAILED = -3,
    VK_ERROR_DEVICE_LOST = -4,
    VK_ERROR_MEMORY_MAP_FAILED = -5,
    VK_ERROR_LAYER_NOT_PRESENT = -6,
    VK_ERROR_EXTENSION_NOT_PRESENT = -7,
    VK_ERROR_FEATURE_NOT_PRESENT = -8,
    VK_ERROR_INCOMPATIBLE_DRIVER = -9,
    VK_ERROR_TOO_MANY_OBJECTS = -10,
    VK_ERROR_FORMAT_NOT_SUPPORTED = -11,
    VK_ERROR_FRAGMENTED_POOL = -12,
    VK_ERROR_SURFACE_LOST_KHR = -1000000000,
    VK_ERROR_NATIVE_WINDOW_IN_USE_KHR = -1000000001,
    VK_SUBOPTIMAL_KHR = 1000001003,
    VK_ERROR_OUT_OF_DATE_KHR = -1000001004,
    VK_ERROR_INCOMPATIBLE_DISPLAY_KHR = -1000003001,
    VK_ERROR_VALIDATION_FAILED_EXT = -1000011001,
    VK_ERROR_INVALID_SHADER_NV = -1000012000,
    VK_ERROR_OUT_OF_POOL_MEMORY_KHR = -1000069000,
    VK_ERROR_INVALID_EXTERNAL_HANDLE_KHR = -1000072003,
    VK_RESULT_RANGE_SIZE = 18,
    VK_RESULT_MAX_ENUM = 2147483647,
}
pub const VkStructureType_VK_STRUCTURE_TYPE_BEGIN_RANGE: VkStructureType =
    VkStructureType::VK_STRUCTURE_TYPE_APPLICATION_INFO;
pub const VkStructureType_VK_STRUCTURE_TYPE_END_RANGE: VkStructureType =
    VkStructureType::VK_STRUCTURE_TYPE_LOADER_DEVICE_CREATE_INFO;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkStructureType {
    VK_STRUCTURE_TYPE_APPLICATION_INFO = 0,
    VK_STRUCTURE_TYPE_INSTANCE_CREATE_INFO = 1,
    VK_STRUCTURE_TYPE_DEVICE_QUEUE_CREATE_INFO = 2,
    VK_STRUCTURE_TYPE_DEVICE_CREATE_INFO = 3,
    VK_STRUCTURE_TYPE_SUBMIT_INFO = 4,
    VK_STRUCTURE_TYPE_MEMORY_ALLOCATE_INFO = 5,
    VK_STRUCTURE_TYPE_MAPPED_MEMORY_RANGE = 6,
    VK_STRUCTURE_TYPE_BIND_SPARSE_INFO = 7,
    VK_STRUCTURE_TYPE_FENCE_CREATE_INFO = 8,
    VK_STRUCTURE_TYPE_SEMAPHORE_CREATE_INFO = 9,
    VK_STRUCTURE_TYPE_EVENT_CREATE_INFO = 10,
    VK_STRUCTURE_TYPE_QUERY_POOL_CREATE_INFO = 11,
    VK_STRUCTURE_TYPE_BUFFER_CREATE_INFO = 12,
    VK_STRUCTURE_TYPE_BUFFER_VIEW_CREATE_INFO = 13,
    VK_STRUCTURE_TYPE_IMAGE_CREATE_INFO = 14,
    VK_STRUCTURE_TYPE_IMAGE_VIEW_CREATE_INFO = 15,
    VK_STRUCTURE_TYPE_SHADER_MODULE_CREATE_INFO = 16,
    VK_STRUCTURE_TYPE_PIPELINE_CACHE_CREATE_INFO = 17,
    VK_STRUCTURE_TYPE_PIPELINE_SHADER_STAGE_CREATE_INFO = 18,
    VK_STRUCTURE_TYPE_PIPELINE_VERTEX_INPUT_STATE_CREATE_INFO = 19,
    VK_STRUCTURE_TYPE_PIPELINE_INPUT_ASSEMBLY_STATE_CREATE_INFO = 20,
    VK_STRUCTURE_TYPE_PIPELINE_TESSELLATION_STATE_CREATE_INFO = 21,
    VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_STATE_CREATE_INFO = 22,
    VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_STATE_CREATE_INFO = 23,
    VK_STRUCTURE_TYPE_PIPELINE_MULTISAMPLE_STATE_CREATE_INFO = 24,
    VK_STRUCTURE_TYPE_PIPELINE_DEPTH_STENCIL_STATE_CREATE_INFO = 25,
    VK_STRUCTURE_TYPE_PIPELINE_COLOR_BLEND_STATE_CREATE_INFO = 26,
    VK_STRUCTURE_TYPE_PIPELINE_DYNAMIC_STATE_CREATE_INFO = 27,
    VK_STRUCTURE_TYPE_GRAPHICS_PIPELINE_CREATE_INFO = 28,
    VK_STRUCTURE_TYPE_COMPUTE_PIPELINE_CREATE_INFO = 29,
    VK_STRUCTURE_TYPE_PIPELINE_LAYOUT_CREATE_INFO = 30,
    VK_STRUCTURE_TYPE_SAMPLER_CREATE_INFO = 31,
    VK_STRUCTURE_TYPE_DESCRIPTOR_SET_LAYOUT_CREATE_INFO = 32,
    VK_STRUCTURE_TYPE_DESCRIPTOR_POOL_CREATE_INFO = 33,
    VK_STRUCTURE_TYPE_DESCRIPTOR_SET_ALLOCATE_INFO = 34,
    VK_STRUCTURE_TYPE_WRITE_DESCRIPTOR_SET = 35,
    VK_STRUCTURE_TYPE_COPY_DESCRIPTOR_SET = 36,
    VK_STRUCTURE_TYPE_FRAMEBUFFER_CREATE_INFO = 37,
    VK_STRUCTURE_TYPE_RENDER_PASS_CREATE_INFO = 38,
    VK_STRUCTURE_TYPE_COMMAND_POOL_CREATE_INFO = 39,
    VK_STRUCTURE_TYPE_COMMAND_BUFFER_ALLOCATE_INFO = 40,
    VK_STRUCTURE_TYPE_COMMAND_BUFFER_INHERITANCE_INFO = 41,
    VK_STRUCTURE_TYPE_COMMAND_BUFFER_BEGIN_INFO = 42,
    VK_STRUCTURE_TYPE_RENDER_PASS_BEGIN_INFO = 43,
    VK_STRUCTURE_TYPE_BUFFER_MEMORY_BARRIER = 44,
    VK_STRUCTURE_TYPE_IMAGE_MEMORY_BARRIER = 45,
    VK_STRUCTURE_TYPE_MEMORY_BARRIER = 46,
    VK_STRUCTURE_TYPE_LOADER_INSTANCE_CREATE_INFO = 47,
    VK_STRUCTURE_TYPE_LOADER_DEVICE_CREATE_INFO = 48,
    VK_STRUCTURE_TYPE_SWAPCHAIN_CREATE_INFO_KHR = 1000001000,
    VK_STRUCTURE_TYPE_PRESENT_INFO_KHR = 1000001001,
    VK_STRUCTURE_TYPE_DISPLAY_MODE_CREATE_INFO_KHR = 1000002000,
    VK_STRUCTURE_TYPE_DISPLAY_SURFACE_CREATE_INFO_KHR = 1000002001,
    VK_STRUCTURE_TYPE_DISPLAY_PRESENT_INFO_KHR = 1000003000,
    VK_STRUCTURE_TYPE_XLIB_SURFACE_CREATE_INFO_KHR = 1000004000,
    VK_STRUCTURE_TYPE_XCB_SURFACE_CREATE_INFO_KHR = 1000005000,
    VK_STRUCTURE_TYPE_WAYLAND_SURFACE_CREATE_INFO_KHR = 1000006000,
    VK_STRUCTURE_TYPE_MIR_SURFACE_CREATE_INFO_KHR = 1000007000,
    VK_STRUCTURE_TYPE_ANDROID_SURFACE_CREATE_INFO_KHR = 1000008000,
    VK_STRUCTURE_TYPE_WIN32_SURFACE_CREATE_INFO_KHR = 1000009000,
    VK_STRUCTURE_TYPE_DEBUG_REPORT_CALLBACK_CREATE_INFO_EXT = 1000011000,
    VK_STRUCTURE_TYPE_PIPELINE_RASTERIZATION_STATE_RASTERIZATION_ORDER_AMD =
        1000018000,
    VK_STRUCTURE_TYPE_DEBUG_MARKER_OBJECT_NAME_INFO_EXT = 1000022000,
    VK_STRUCTURE_TYPE_DEBUG_MARKER_OBJECT_TAG_INFO_EXT = 1000022001,
    VK_STRUCTURE_TYPE_DEBUG_MARKER_MARKER_INFO_EXT = 1000022002,
    VK_STRUCTURE_TYPE_DEDICATED_ALLOCATION_IMAGE_CREATE_INFO_NV = 1000026000,
    VK_STRUCTURE_TYPE_DEDICATED_ALLOCATION_BUFFER_CREATE_INFO_NV = 1000026001,
    VK_STRUCTURE_TYPE_DEDICATED_ALLOCATION_MEMORY_ALLOCATE_INFO_NV =
        1000026002,
    VK_STRUCTURE_TYPE_TEXTURE_LOD_GATHER_FORMAT_PROPERTIES_AMD = 1000041000,
    VK_STRUCTURE_TYPE_RENDER_PASS_MULTIVIEW_CREATE_INFO_KHX = 1000053000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_FEATURES_KHX = 1000053001,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_PROPERTIES_KHX = 1000053002,
    VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_IMAGE_CREATE_INFO_NV = 1000056000,
    VK_STRUCTURE_TYPE_EXPORT_MEMORY_ALLOCATE_INFO_NV = 1000056001,
    VK_STRUCTURE_TYPE_IMPORT_MEMORY_WIN32_HANDLE_INFO_NV = 1000057000,
    VK_STRUCTURE_TYPE_EXPORT_MEMORY_WIN32_HANDLE_INFO_NV = 1000057001,
    VK_STRUCTURE_TYPE_WIN32_KEYED_MUTEX_ACQUIRE_RELEASE_INFO_NV = 1000058000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_FEATURES_2_KHR = 1000059000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PROPERTIES_2_KHR = 1000059001,
    VK_STRUCTURE_TYPE_FORMAT_PROPERTIES_2_KHR = 1000059002,
    VK_STRUCTURE_TYPE_IMAGE_FORMAT_PROPERTIES_2_KHR = 1000059003,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_IMAGE_FORMAT_INFO_2_KHR = 1000059004,
    VK_STRUCTURE_TYPE_QUEUE_FAMILY_PROPERTIES_2_KHR = 1000059005,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MEMORY_PROPERTIES_2_KHR = 1000059006,
    VK_STRUCTURE_TYPE_SPARSE_IMAGE_FORMAT_PROPERTIES_2_KHR = 1000059007,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SPARSE_IMAGE_FORMAT_INFO_2_KHR =
        1000059008,
    VK_STRUCTURE_TYPE_MEMORY_ALLOCATE_FLAGS_INFO_KHX = 1000060000,
    VK_STRUCTURE_TYPE_BIND_BUFFER_MEMORY_INFO_KHX = 1000060001,
    VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_INFO_KHX = 1000060002,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_RENDER_PASS_BEGIN_INFO_KHX = 1000060003,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_COMMAND_BUFFER_BEGIN_INFO_KHX = 1000060004,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_SUBMIT_INFO_KHX = 1000060005,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_BIND_SPARSE_INFO_KHX = 1000060006,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_PRESENT_CAPABILITIES_KHX = 1000060007,
    VK_STRUCTURE_TYPE_IMAGE_SWAPCHAIN_CREATE_INFO_KHX = 1000060008,
    VK_STRUCTURE_TYPE_BIND_IMAGE_MEMORY_SWAPCHAIN_INFO_KHX = 1000060009,
    VK_STRUCTURE_TYPE_ACQUIRE_NEXT_IMAGE_INFO_KHX = 1000060010,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_PRESENT_INFO_KHX = 1000060011,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_SWAPCHAIN_CREATE_INFO_KHX = 1000060012,
    VK_STRUCTURE_TYPE_VALIDATION_FLAGS_EXT = 1000061000,
    VK_STRUCTURE_TYPE_VI_SURFACE_CREATE_INFO_NN = 1000062000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_GROUP_PROPERTIES_KHX = 1000070000,
    VK_STRUCTURE_TYPE_DEVICE_GROUP_DEVICE_CREATE_INFO_KHX = 1000070001,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_IMAGE_FORMAT_INFO_KHR =
        1000071000,
    VK_STRUCTURE_TYPE_EXTERNAL_IMAGE_FORMAT_PROPERTIES_KHR = 1000071001,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_BUFFER_INFO_KHR = 1000071002,
    VK_STRUCTURE_TYPE_EXTERNAL_BUFFER_PROPERTIES_KHR = 1000071003,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_ID_PROPERTIES_KHR = 1000071004,
    VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_BUFFER_CREATE_INFO_KHR = 1000072000,
    VK_STRUCTURE_TYPE_EXTERNAL_MEMORY_IMAGE_CREATE_INFO_KHR = 1000072001,
    VK_STRUCTURE_TYPE_EXPORT_MEMORY_ALLOCATE_INFO_KHR = 1000072002,
    VK_STRUCTURE_TYPE_IMPORT_MEMORY_WIN32_HANDLE_INFO_KHR = 1000073000,
    VK_STRUCTURE_TYPE_EXPORT_MEMORY_WIN32_HANDLE_INFO_KHR = 1000073001,
    VK_STRUCTURE_TYPE_MEMORY_WIN32_HANDLE_PROPERTIES_KHR = 1000073002,
    VK_STRUCTURE_TYPE_MEMORY_GET_WIN32_HANDLE_INFO_KHR = 1000073003,
    VK_STRUCTURE_TYPE_IMPORT_MEMORY_FD_INFO_KHR = 1000074000,
    VK_STRUCTURE_TYPE_MEMORY_FD_PROPERTIES_KHR = 1000074001,
    VK_STRUCTURE_TYPE_MEMORY_GET_FD_INFO_KHR = 1000074002,
    VK_STRUCTURE_TYPE_WIN32_KEYED_MUTEX_ACQUIRE_RELEASE_INFO_KHR = 1000075000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_SEMAPHORE_INFO_KHR =
        1000076000,
    VK_STRUCTURE_TYPE_EXTERNAL_SEMAPHORE_PROPERTIES_KHR = 1000076001,
    VK_STRUCTURE_TYPE_EXPORT_SEMAPHORE_CREATE_INFO_KHR = 1000077000,
    VK_STRUCTURE_TYPE_IMPORT_SEMAPHORE_WIN32_HANDLE_INFO_KHR = 1000078000,
    VK_STRUCTURE_TYPE_EXPORT_SEMAPHORE_WIN32_HANDLE_INFO_KHR = 1000078001,
    VK_STRUCTURE_TYPE_D3D12_FENCE_SUBMIT_INFO_KHR = 1000078002,
    VK_STRUCTURE_TYPE_SEMAPHORE_GET_WIN32_HANDLE_INFO_KHR = 1000078003,
    VK_STRUCTURE_TYPE_IMPORT_SEMAPHORE_FD_INFO_KHR = 1000079000,
    VK_STRUCTURE_TYPE_SEMAPHORE_GET_FD_INFO_KHR = 1000079001,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_PUSH_DESCRIPTOR_PROPERTIES_KHR =
        1000080000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_16BIT_STORAGE_FEATURES_KHR = 1000083000,
    VK_STRUCTURE_TYPE_PRESENT_REGIONS_KHR = 1000084000,
    VK_STRUCTURE_TYPE_DESCRIPTOR_UPDATE_TEMPLATE_CREATE_INFO_KHR = 1000085000,
    VK_STRUCTURE_TYPE_OBJECT_TABLE_CREATE_INFO_NVX = 1000086000,
    VK_STRUCTURE_TYPE_INDIRECT_COMMANDS_LAYOUT_CREATE_INFO_NVX = 1000086001,
    VK_STRUCTURE_TYPE_CMD_PROCESS_COMMANDS_INFO_NVX = 1000086002,
    VK_STRUCTURE_TYPE_CMD_RESERVE_SPACE_FOR_COMMANDS_INFO_NVX = 1000086003,
    VK_STRUCTURE_TYPE_DEVICE_GENERATED_COMMANDS_LIMITS_NVX = 1000086004,
    VK_STRUCTURE_TYPE_DEVICE_GENERATED_COMMANDS_FEATURES_NVX = 1000086005,
    VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_W_SCALING_STATE_CREATE_INFO_NV =
        1000087000,
    VK_STRUCTURE_TYPE_SURFACE_CAPABILITIES_2_EXT = 1000090000,
    VK_STRUCTURE_TYPE_DISPLAY_POWER_INFO_EXT = 1000091000,
    VK_STRUCTURE_TYPE_DEVICE_EVENT_INFO_EXT = 1000091001,
    VK_STRUCTURE_TYPE_DISPLAY_EVENT_INFO_EXT = 1000091002,
    VK_STRUCTURE_TYPE_SWAPCHAIN_COUNTER_CREATE_INFO_EXT = 1000091003,
    VK_STRUCTURE_TYPE_PRESENT_TIMES_INFO_GOOGLE = 1000092000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_MULTIVIEW_PER_VIEW_ATTRIBUTES_PROPERTIES_NVX
        = 1000097000,
    VK_STRUCTURE_TYPE_PIPELINE_VIEWPORT_SWIZZLE_STATE_CREATE_INFO_NV =
        1000098000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_DISCARD_RECTANGLE_PROPERTIES_EXT =
        1000099000,
    VK_STRUCTURE_TYPE_PIPELINE_DISCARD_RECTANGLE_STATE_CREATE_INFO_EXT =
        1000099001,
    VK_STRUCTURE_TYPE_HDR_METADATA_EXT = 1000105000,
    VK_STRUCTURE_TYPE_SHARED_PRESENT_SURFACE_CAPABILITIES_KHR = 1000111000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_EXTERNAL_FENCE_INFO_KHR = 1000112000,
    VK_STRUCTURE_TYPE_EXTERNAL_FENCE_PROPERTIES_KHR = 1000112001,
    VK_STRUCTURE_TYPE_EXPORT_FENCE_CREATE_INFO_KHR = 1000113000,
    VK_STRUCTURE_TYPE_IMPORT_FENCE_WIN32_HANDLE_INFO_KHR = 1000114000,
    VK_STRUCTURE_TYPE_EXPORT_FENCE_WIN32_HANDLE_INFO_KHR = 1000114001,
    VK_STRUCTURE_TYPE_FENCE_GET_WIN32_HANDLE_INFO_KHR = 1000114002,
    VK_STRUCTURE_TYPE_IMPORT_FENCE_FD_INFO_KHR = 1000115000,
    VK_STRUCTURE_TYPE_FENCE_GET_FD_INFO_KHR = 1000115001,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SURFACE_INFO_2_KHR = 1000119000,
    VK_STRUCTURE_TYPE_SURFACE_CAPABILITIES_2_KHR = 1000119001,
    VK_STRUCTURE_TYPE_SURFACE_FORMAT_2_KHR = 1000119002,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_VARIABLE_POINTER_FEATURES_KHR =
        1000120000,
    VK_STRUCTURE_TYPE_IOS_SURFACE_CREATE_INFO_MVK = 1000122000,
    VK_STRUCTURE_TYPE_MACOS_SURFACE_CREATE_INFO_MVK = 1000123000,
    VK_STRUCTURE_TYPE_MEMORY_DEDICATED_REQUIREMENTS_KHR = 1000127000,
    VK_STRUCTURE_TYPE_MEMORY_DEDICATED_ALLOCATE_INFO_KHR = 1000127001,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_SAMPLER_FILTER_MINMAX_PROPERTIES_EXT =
        1000130000,
    VK_STRUCTURE_TYPE_SAMPLER_REDUCTION_MODE_CREATE_INFO_EXT = 1000130001,
    VK_STRUCTURE_TYPE_BUFFER_MEMORY_REQUIREMENTS_INFO_2_KHR = 1000146000,
    VK_STRUCTURE_TYPE_IMAGE_MEMORY_REQUIREMENTS_INFO_2_KHR = 1000146001,
    VK_STRUCTURE_TYPE_IMAGE_SPARSE_MEMORY_REQUIREMENTS_INFO_2_KHR =
        1000146002,
    VK_STRUCTURE_TYPE_MEMORY_REQUIREMENTS_2_KHR = 1000146003,
    VK_STRUCTURE_TYPE_SPARSE_IMAGE_MEMORY_REQUIREMENTS_2_KHR = 1000146004,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BLEND_OPERATION_ADVANCED_FEATURES_EXT =
        1000148000,
    VK_STRUCTURE_TYPE_PHYSICAL_DEVICE_BLEND_OPERATION_ADVANCED_PROPERTIES_EXT
        = 1000148001,
    VK_STRUCTURE_TYPE_PIPELINE_COLOR_BLEND_ADVANCED_STATE_CREATE_INFO_EXT =
        1000148002,
    VK_STRUCTURE_TYPE_PIPELINE_COVERAGE_TO_COLOR_STATE_CREATE_INFO_NV =
        1000149000,
    VK_STRUCTURE_TYPE_PIPELINE_COVERAGE_MODULATION_STATE_CREATE_INFO_NV =
        1000152000,
    VK_STRUCTURE_TYPE_RANGE_SIZE = 49,
    VK_STRUCTURE_TYPE_MAX_ENUM = 2147483647,
}
pub const VkSystemAllocationScope_VK_SYSTEM_ALLOCATION_SCOPE_BEGIN_RANGE:
          VkSystemAllocationScope =
    VkSystemAllocationScope::VK_SYSTEM_ALLOCATION_SCOPE_COMMAND;
pub const VkSystemAllocationScope_VK_SYSTEM_ALLOCATION_SCOPE_END_RANGE:
          VkSystemAllocationScope =
    VkSystemAllocationScope::VK_SYSTEM_ALLOCATION_SCOPE_INSTANCE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSystemAllocationScope {
    VK_SYSTEM_ALLOCATION_SCOPE_COMMAND = 0,
    VK_SYSTEM_ALLOCATION_SCOPE_OBJECT = 1,
    VK_SYSTEM_ALLOCATION_SCOPE_CACHE = 2,
    VK_SYSTEM_ALLOCATION_SCOPE_DEVICE = 3,
    VK_SYSTEM_ALLOCATION_SCOPE_INSTANCE = 4,
    VK_SYSTEM_ALLOCATION_SCOPE_RANGE_SIZE = 5,
    VK_SYSTEM_ALLOCATION_SCOPE_MAX_ENUM = 2147483647,
}
pub const VkInternalAllocationType_VK_INTERNAL_ALLOCATION_TYPE_BEGIN_RANGE:
          VkInternalAllocationType =
    VkInternalAllocationType::VK_INTERNAL_ALLOCATION_TYPE_EXECUTABLE;
pub const VkInternalAllocationType_VK_INTERNAL_ALLOCATION_TYPE_END_RANGE:
          VkInternalAllocationType =
    VkInternalAllocationType::VK_INTERNAL_ALLOCATION_TYPE_EXECUTABLE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkInternalAllocationType {
    VK_INTERNAL_ALLOCATION_TYPE_EXECUTABLE = 0,
    VK_INTERNAL_ALLOCATION_TYPE_RANGE_SIZE = 1,
    VK_INTERNAL_ALLOCATION_TYPE_MAX_ENUM = 2147483647,
}
pub const VkFormat_VK_FORMAT_BEGIN_RANGE: VkFormat =
    VkFormat::VK_FORMAT_UNDEFINED;
pub const VkFormat_VK_FORMAT_END_RANGE: VkFormat =
    VkFormat::VK_FORMAT_ASTC_12x12_SRGB_BLOCK;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkFormat {
    VK_FORMAT_UNDEFINED = 0,
    VK_FORMAT_R4G4_UNORM_PACK8 = 1,
    VK_FORMAT_R4G4B4A4_UNORM_PACK16 = 2,
    VK_FORMAT_B4G4R4A4_UNORM_PACK16 = 3,
    VK_FORMAT_R5G6B5_UNORM_PACK16 = 4,
    VK_FORMAT_B5G6R5_UNORM_PACK16 = 5,
    VK_FORMAT_R5G5B5A1_UNORM_PACK16 = 6,
    VK_FORMAT_B5G5R5A1_UNORM_PACK16 = 7,
    VK_FORMAT_A1R5G5B5_UNORM_PACK16 = 8,
    VK_FORMAT_R8_UNORM = 9,
    VK_FORMAT_R8_SNORM = 10,
    VK_FORMAT_R8_USCALED = 11,
    VK_FORMAT_R8_SSCALED = 12,
    VK_FORMAT_R8_UINT = 13,
    VK_FORMAT_R8_SINT = 14,
    VK_FORMAT_R8_SRGB = 15,
    VK_FORMAT_R8G8_UNORM = 16,
    VK_FORMAT_R8G8_SNORM = 17,
    VK_FORMAT_R8G8_USCALED = 18,
    VK_FORMAT_R8G8_SSCALED = 19,
    VK_FORMAT_R8G8_UINT = 20,
    VK_FORMAT_R8G8_SINT = 21,
    VK_FORMAT_R8G8_SRGB = 22,
    VK_FORMAT_R8G8B8_UNORM = 23,
    VK_FORMAT_R8G8B8_SNORM = 24,
    VK_FORMAT_R8G8B8_USCALED = 25,
    VK_FORMAT_R8G8B8_SSCALED = 26,
    VK_FORMAT_R8G8B8_UINT = 27,
    VK_FORMAT_R8G8B8_SINT = 28,
    VK_FORMAT_R8G8B8_SRGB = 29,
    VK_FORMAT_B8G8R8_UNORM = 30,
    VK_FORMAT_B8G8R8_SNORM = 31,
    VK_FORMAT_B8G8R8_USCALED = 32,
    VK_FORMAT_B8G8R8_SSCALED = 33,
    VK_FORMAT_B8G8R8_UINT = 34,
    VK_FORMAT_B8G8R8_SINT = 35,
    VK_FORMAT_B8G8R8_SRGB = 36,
    VK_FORMAT_R8G8B8A8_UNORM = 37,
    VK_FORMAT_R8G8B8A8_SNORM = 38,
    VK_FORMAT_R8G8B8A8_USCALED = 39,
    VK_FORMAT_R8G8B8A8_SSCALED = 40,
    VK_FORMAT_R8G8B8A8_UINT = 41,
    VK_FORMAT_R8G8B8A8_SINT = 42,
    VK_FORMAT_R8G8B8A8_SRGB = 43,
    VK_FORMAT_B8G8R8A8_UNORM = 44,
    VK_FORMAT_B8G8R8A8_SNORM = 45,
    VK_FORMAT_B8G8R8A8_USCALED = 46,
    VK_FORMAT_B8G8R8A8_SSCALED = 47,
    VK_FORMAT_B8G8R8A8_UINT = 48,
    VK_FORMAT_B8G8R8A8_SINT = 49,
    VK_FORMAT_B8G8R8A8_SRGB = 50,
    VK_FORMAT_A8B8G8R8_UNORM_PACK32 = 51,
    VK_FORMAT_A8B8G8R8_SNORM_PACK32 = 52,
    VK_FORMAT_A8B8G8R8_USCALED_PACK32 = 53,
    VK_FORMAT_A8B8G8R8_SSCALED_PACK32 = 54,
    VK_FORMAT_A8B8G8R8_UINT_PACK32 = 55,
    VK_FORMAT_A8B8G8R8_SINT_PACK32 = 56,
    VK_FORMAT_A8B8G8R8_SRGB_PACK32 = 57,
    VK_FORMAT_A2R10G10B10_UNORM_PACK32 = 58,
    VK_FORMAT_A2R10G10B10_SNORM_PACK32 = 59,
    VK_FORMAT_A2R10G10B10_USCALED_PACK32 = 60,
    VK_FORMAT_A2R10G10B10_SSCALED_PACK32 = 61,
    VK_FORMAT_A2R10G10B10_UINT_PACK32 = 62,
    VK_FORMAT_A2R10G10B10_SINT_PACK32 = 63,
    VK_FORMAT_A2B10G10R10_UNORM_PACK32 = 64,
    VK_FORMAT_A2B10G10R10_SNORM_PACK32 = 65,
    VK_FORMAT_A2B10G10R10_USCALED_PACK32 = 66,
    VK_FORMAT_A2B10G10R10_SSCALED_PACK32 = 67,
    VK_FORMAT_A2B10G10R10_UINT_PACK32 = 68,
    VK_FORMAT_A2B10G10R10_SINT_PACK32 = 69,
    VK_FORMAT_R16_UNORM = 70,
    VK_FORMAT_R16_SNORM = 71,
    VK_FORMAT_R16_USCALED = 72,
    VK_FORMAT_R16_SSCALED = 73,
    VK_FORMAT_R16_UINT = 74,
    VK_FORMAT_R16_SINT = 75,
    VK_FORMAT_R16_SFLOAT = 76,
    VK_FORMAT_R16G16_UNORM = 77,
    VK_FORMAT_R16G16_SNORM = 78,
    VK_FORMAT_R16G16_USCALED = 79,
    VK_FORMAT_R16G16_SSCALED = 80,
    VK_FORMAT_R16G16_UINT = 81,
    VK_FORMAT_R16G16_SINT = 82,
    VK_FORMAT_R16G16_SFLOAT = 83,
    VK_FORMAT_R16G16B16_UNORM = 84,
    VK_FORMAT_R16G16B16_SNORM = 85,
    VK_FORMAT_R16G16B16_USCALED = 86,
    VK_FORMAT_R16G16B16_SSCALED = 87,
    VK_FORMAT_R16G16B16_UINT = 88,
    VK_FORMAT_R16G16B16_SINT = 89,
    VK_FORMAT_R16G16B16_SFLOAT = 90,
    VK_FORMAT_R16G16B16A16_UNORM = 91,
    VK_FORMAT_R16G16B16A16_SNORM = 92,
    VK_FORMAT_R16G16B16A16_USCALED = 93,
    VK_FORMAT_R16G16B16A16_SSCALED = 94,
    VK_FORMAT_R16G16B16A16_UINT = 95,
    VK_FORMAT_R16G16B16A16_SINT = 96,
    VK_FORMAT_R16G16B16A16_SFLOAT = 97,
    VK_FORMAT_R32_UINT = 98,
    VK_FORMAT_R32_SINT = 99,
    VK_FORMAT_R32_SFLOAT = 100,
    VK_FORMAT_R32G32_UINT = 101,
    VK_FORMAT_R32G32_SINT = 102,
    VK_FORMAT_R32G32_SFLOAT = 103,
    VK_FORMAT_R32G32B32_UINT = 104,
    VK_FORMAT_R32G32B32_SINT = 105,
    VK_FORMAT_R32G32B32_SFLOAT = 106,
    VK_FORMAT_R32G32B32A32_UINT = 107,
    VK_FORMAT_R32G32B32A32_SINT = 108,
    VK_FORMAT_R32G32B32A32_SFLOAT = 109,
    VK_FORMAT_R64_UINT = 110,
    VK_FORMAT_R64_SINT = 111,
    VK_FORMAT_R64_SFLOAT = 112,
    VK_FORMAT_R64G64_UINT = 113,
    VK_FORMAT_R64G64_SINT = 114,
    VK_FORMAT_R64G64_SFLOAT = 115,
    VK_FORMAT_R64G64B64_UINT = 116,
    VK_FORMAT_R64G64B64_SINT = 117,
    VK_FORMAT_R64G64B64_SFLOAT = 118,
    VK_FORMAT_R64G64B64A64_UINT = 119,
    VK_FORMAT_R64G64B64A64_SINT = 120,
    VK_FORMAT_R64G64B64A64_SFLOAT = 121,
    VK_FORMAT_B10G11R11_UFLOAT_PACK32 = 122,
    VK_FORMAT_E5B9G9R9_UFLOAT_PACK32 = 123,
    VK_FORMAT_D16_UNORM = 124,
    VK_FORMAT_X8_D24_UNORM_PACK32 = 125,
    VK_FORMAT_D32_SFLOAT = 126,
    VK_FORMAT_S8_UINT = 127,
    VK_FORMAT_D16_UNORM_S8_UINT = 128,
    VK_FORMAT_D24_UNORM_S8_UINT = 129,
    VK_FORMAT_D32_SFLOAT_S8_UINT = 130,
    VK_FORMAT_BC1_RGB_UNORM_BLOCK = 131,
    VK_FORMAT_BC1_RGB_SRGB_BLOCK = 132,
    VK_FORMAT_BC1_RGBA_UNORM_BLOCK = 133,
    VK_FORMAT_BC1_RGBA_SRGB_BLOCK = 134,
    VK_FORMAT_BC2_UNORM_BLOCK = 135,
    VK_FORMAT_BC2_SRGB_BLOCK = 136,
    VK_FORMAT_BC3_UNORM_BLOCK = 137,
    VK_FORMAT_BC3_SRGB_BLOCK = 138,
    VK_FORMAT_BC4_UNORM_BLOCK = 139,
    VK_FORMAT_BC4_SNORM_BLOCK = 140,
    VK_FORMAT_BC5_UNORM_BLOCK = 141,
    VK_FORMAT_BC5_SNORM_BLOCK = 142,
    VK_FORMAT_BC6H_UFLOAT_BLOCK = 143,
    VK_FORMAT_BC6H_SFLOAT_BLOCK = 144,
    VK_FORMAT_BC7_UNORM_BLOCK = 145,
    VK_FORMAT_BC7_SRGB_BLOCK = 146,
    VK_FORMAT_ETC2_R8G8B8_UNORM_BLOCK = 147,
    VK_FORMAT_ETC2_R8G8B8_SRGB_BLOCK = 148,
    VK_FORMAT_ETC2_R8G8B8A1_UNORM_BLOCK = 149,
    VK_FORMAT_ETC2_R8G8B8A1_SRGB_BLOCK = 150,
    VK_FORMAT_ETC2_R8G8B8A8_UNORM_BLOCK = 151,
    VK_FORMAT_ETC2_R8G8B8A8_SRGB_BLOCK = 152,
    VK_FORMAT_EAC_R11_UNORM_BLOCK = 153,
    VK_FORMAT_EAC_R11_SNORM_BLOCK = 154,
    VK_FORMAT_EAC_R11G11_UNORM_BLOCK = 155,
    VK_FORMAT_EAC_R11G11_SNORM_BLOCK = 156,
    VK_FORMAT_ASTC_4x4_UNORM_BLOCK = 157,
    VK_FORMAT_ASTC_4x4_SRGB_BLOCK = 158,
    VK_FORMAT_ASTC_5x4_UNORM_BLOCK = 159,
    VK_FORMAT_ASTC_5x4_SRGB_BLOCK = 160,
    VK_FORMAT_ASTC_5x5_UNORM_BLOCK = 161,
    VK_FORMAT_ASTC_5x5_SRGB_BLOCK = 162,
    VK_FORMAT_ASTC_6x5_UNORM_BLOCK = 163,
    VK_FORMAT_ASTC_6x5_SRGB_BLOCK = 164,
    VK_FORMAT_ASTC_6x6_UNORM_BLOCK = 165,
    VK_FORMAT_ASTC_6x6_SRGB_BLOCK = 166,
    VK_FORMAT_ASTC_8x5_UNORM_BLOCK = 167,
    VK_FORMAT_ASTC_8x5_SRGB_BLOCK = 168,
    VK_FORMAT_ASTC_8x6_UNORM_BLOCK = 169,
    VK_FORMAT_ASTC_8x6_SRGB_BLOCK = 170,
    VK_FORMAT_ASTC_8x8_UNORM_BLOCK = 171,
    VK_FORMAT_ASTC_8x8_SRGB_BLOCK = 172,
    VK_FORMAT_ASTC_10x5_UNORM_BLOCK = 173,
    VK_FORMAT_ASTC_10x5_SRGB_BLOCK = 174,
    VK_FORMAT_ASTC_10x6_UNORM_BLOCK = 175,
    VK_FORMAT_ASTC_10x6_SRGB_BLOCK = 176,
    VK_FORMAT_ASTC_10x8_UNORM_BLOCK = 177,
    VK_FORMAT_ASTC_10x8_SRGB_BLOCK = 178,
    VK_FORMAT_ASTC_10x10_UNORM_BLOCK = 179,
    VK_FORMAT_ASTC_10x10_SRGB_BLOCK = 180,
    VK_FORMAT_ASTC_12x10_UNORM_BLOCK = 181,
    VK_FORMAT_ASTC_12x10_SRGB_BLOCK = 182,
    VK_FORMAT_ASTC_12x12_UNORM_BLOCK = 183,
    VK_FORMAT_ASTC_12x12_SRGB_BLOCK = 184,
    VK_FORMAT_PVRTC1_2BPP_UNORM_BLOCK_IMG = 1000054000,
    VK_FORMAT_PVRTC1_4BPP_UNORM_BLOCK_IMG = 1000054001,
    VK_FORMAT_PVRTC2_2BPP_UNORM_BLOCK_IMG = 1000054002,
    VK_FORMAT_PVRTC2_4BPP_UNORM_BLOCK_IMG = 1000054003,
    VK_FORMAT_PVRTC1_2BPP_SRGB_BLOCK_IMG = 1000054004,
    VK_FORMAT_PVRTC1_4BPP_SRGB_BLOCK_IMG = 1000054005,
    VK_FORMAT_PVRTC2_2BPP_SRGB_BLOCK_IMG = 1000054006,
    VK_FORMAT_PVRTC2_4BPP_SRGB_BLOCK_IMG = 1000054007,
    VK_FORMAT_RANGE_SIZE = 185,
    VK_FORMAT_MAX_ENUM = 2147483647,
}
pub const VkImageType_VK_IMAGE_TYPE_BEGIN_RANGE: VkImageType =
    VkImageType::VK_IMAGE_TYPE_1D;
pub const VkImageType_VK_IMAGE_TYPE_END_RANGE: VkImageType =
    VkImageType::VK_IMAGE_TYPE_3D;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageType {
    VK_IMAGE_TYPE_1D = 0,
    VK_IMAGE_TYPE_2D = 1,
    VK_IMAGE_TYPE_3D = 2,
    VK_IMAGE_TYPE_RANGE_SIZE = 3,
    VK_IMAGE_TYPE_MAX_ENUM = 2147483647,
}
pub const VkImageTiling_VK_IMAGE_TILING_BEGIN_RANGE: VkImageTiling =
    VkImageTiling::VK_IMAGE_TILING_OPTIMAL;
pub const VkImageTiling_VK_IMAGE_TILING_END_RANGE: VkImageTiling =
    VkImageTiling::VK_IMAGE_TILING_LINEAR;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageTiling {
    VK_IMAGE_TILING_OPTIMAL = 0,
    VK_IMAGE_TILING_LINEAR = 1,
    VK_IMAGE_TILING_RANGE_SIZE = 2,
    VK_IMAGE_TILING_MAX_ENUM = 2147483647,
}
pub const VkPhysicalDeviceType_VK_PHYSICAL_DEVICE_TYPE_BEGIN_RANGE:
          VkPhysicalDeviceType =
    VkPhysicalDeviceType::VK_PHYSICAL_DEVICE_TYPE_OTHER;
pub const VkPhysicalDeviceType_VK_PHYSICAL_DEVICE_TYPE_END_RANGE:
          VkPhysicalDeviceType =
    VkPhysicalDeviceType::VK_PHYSICAL_DEVICE_TYPE_CPU;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPhysicalDeviceType {
    VK_PHYSICAL_DEVICE_TYPE_OTHER = 0,
    VK_PHYSICAL_DEVICE_TYPE_INTEGRATED_GPU = 1,
    VK_PHYSICAL_DEVICE_TYPE_DISCRETE_GPU = 2,
    VK_PHYSICAL_DEVICE_TYPE_VIRTUAL_GPU = 3,
    VK_PHYSICAL_DEVICE_TYPE_CPU = 4,
    VK_PHYSICAL_DEVICE_TYPE_RANGE_SIZE = 5,
    VK_PHYSICAL_DEVICE_TYPE_MAX_ENUM = 2147483647,
}
pub const VkQueryType_VK_QUERY_TYPE_BEGIN_RANGE: VkQueryType =
    VkQueryType::VK_QUERY_TYPE_OCCLUSION;
pub const VkQueryType_VK_QUERY_TYPE_END_RANGE: VkQueryType =
    VkQueryType::VK_QUERY_TYPE_TIMESTAMP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkQueryType {
    VK_QUERY_TYPE_OCCLUSION = 0,
    VK_QUERY_TYPE_PIPELINE_STATISTICS = 1,
    VK_QUERY_TYPE_TIMESTAMP = 2,
    VK_QUERY_TYPE_RANGE_SIZE = 3,
    VK_QUERY_TYPE_MAX_ENUM = 2147483647,
}
pub const VkSharingMode_VK_SHARING_MODE_BEGIN_RANGE: VkSharingMode =
    VkSharingMode::VK_SHARING_MODE_EXCLUSIVE;
pub const VkSharingMode_VK_SHARING_MODE_END_RANGE: VkSharingMode =
    VkSharingMode::VK_SHARING_MODE_CONCURRENT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSharingMode {
    VK_SHARING_MODE_EXCLUSIVE = 0,
    VK_SHARING_MODE_CONCURRENT = 1,
    VK_SHARING_MODE_RANGE_SIZE = 2,
    VK_SHARING_MODE_MAX_ENUM = 2147483647,
}
pub const VkImageLayout_VK_IMAGE_LAYOUT_BEGIN_RANGE: VkImageLayout =
    VkImageLayout::VK_IMAGE_LAYOUT_UNDEFINED;
pub const VkImageLayout_VK_IMAGE_LAYOUT_END_RANGE: VkImageLayout =
    VkImageLayout::VK_IMAGE_LAYOUT_PREINITIALIZED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageLayout {
    VK_IMAGE_LAYOUT_UNDEFINED = 0,
    VK_IMAGE_LAYOUT_GENERAL = 1,
    VK_IMAGE_LAYOUT_COLOR_ATTACHMENT_OPTIMAL = 2,
    VK_IMAGE_LAYOUT_DEPTH_STENCIL_ATTACHMENT_OPTIMAL = 3,
    VK_IMAGE_LAYOUT_DEPTH_STENCIL_READ_ONLY_OPTIMAL = 4,
    VK_IMAGE_LAYOUT_SHADER_READ_ONLY_OPTIMAL = 5,
    VK_IMAGE_LAYOUT_TRANSFER_SRC_OPTIMAL = 6,
    VK_IMAGE_LAYOUT_TRANSFER_DST_OPTIMAL = 7,
    VK_IMAGE_LAYOUT_PREINITIALIZED = 8,
    VK_IMAGE_LAYOUT_PRESENT_SRC_KHR = 1000001002,
    VK_IMAGE_LAYOUT_SHARED_PRESENT_KHR = 1000111000,
    VK_IMAGE_LAYOUT_RANGE_SIZE = 9,
    VK_IMAGE_LAYOUT_MAX_ENUM = 2147483647,
}
pub const VkImageViewType_VK_IMAGE_VIEW_TYPE_BEGIN_RANGE: VkImageViewType =
    VkImageViewType::VK_IMAGE_VIEW_TYPE_1D;
pub const VkImageViewType_VK_IMAGE_VIEW_TYPE_END_RANGE: VkImageViewType =
    VkImageViewType::VK_IMAGE_VIEW_TYPE_CUBE_ARRAY;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageViewType {
    VK_IMAGE_VIEW_TYPE_1D = 0,
    VK_IMAGE_VIEW_TYPE_2D = 1,
    VK_IMAGE_VIEW_TYPE_3D = 2,
    VK_IMAGE_VIEW_TYPE_CUBE = 3,
    VK_IMAGE_VIEW_TYPE_1D_ARRAY = 4,
    VK_IMAGE_VIEW_TYPE_2D_ARRAY = 5,
    VK_IMAGE_VIEW_TYPE_CUBE_ARRAY = 6,
    VK_IMAGE_VIEW_TYPE_RANGE_SIZE = 7,
    VK_IMAGE_VIEW_TYPE_MAX_ENUM = 2147483647,
}
pub const VkComponentSwizzle_VK_COMPONENT_SWIZZLE_BEGIN_RANGE:
          VkComponentSwizzle =
    VkComponentSwizzle::VK_COMPONENT_SWIZZLE_IDENTITY;
pub const VkComponentSwizzle_VK_COMPONENT_SWIZZLE_END_RANGE:
          VkComponentSwizzle =
    VkComponentSwizzle::VK_COMPONENT_SWIZZLE_A;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkComponentSwizzle {
    VK_COMPONENT_SWIZZLE_IDENTITY = 0,
    VK_COMPONENT_SWIZZLE_ZERO = 1,
    VK_COMPONENT_SWIZZLE_ONE = 2,
    VK_COMPONENT_SWIZZLE_R = 3,
    VK_COMPONENT_SWIZZLE_G = 4,
    VK_COMPONENT_SWIZZLE_B = 5,
    VK_COMPONENT_SWIZZLE_A = 6,
    VK_COMPONENT_SWIZZLE_RANGE_SIZE = 7,
    VK_COMPONENT_SWIZZLE_MAX_ENUM = 2147483647,
}
pub const VkVertexInputRate_VK_VERTEX_INPUT_RATE_BEGIN_RANGE:
          VkVertexInputRate =
    VkVertexInputRate::VK_VERTEX_INPUT_RATE_VERTEX;
pub const VkVertexInputRate_VK_VERTEX_INPUT_RATE_END_RANGE: VkVertexInputRate
          =
    VkVertexInputRate::VK_VERTEX_INPUT_RATE_INSTANCE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkVertexInputRate {
    VK_VERTEX_INPUT_RATE_VERTEX = 0,
    VK_VERTEX_INPUT_RATE_INSTANCE = 1,
    VK_VERTEX_INPUT_RATE_RANGE_SIZE = 2,
    VK_VERTEX_INPUT_RATE_MAX_ENUM = 2147483647,
}
pub const VkPrimitiveTopology_VK_PRIMITIVE_TOPOLOGY_BEGIN_RANGE:
          VkPrimitiveTopology =
    VkPrimitiveTopology::VK_PRIMITIVE_TOPOLOGY_POINT_LIST;
pub const VkPrimitiveTopology_VK_PRIMITIVE_TOPOLOGY_END_RANGE:
          VkPrimitiveTopology =
    VkPrimitiveTopology::VK_PRIMITIVE_TOPOLOGY_PATCH_LIST;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPrimitiveTopology {
    VK_PRIMITIVE_TOPOLOGY_POINT_LIST = 0,
    VK_PRIMITIVE_TOPOLOGY_LINE_LIST = 1,
    VK_PRIMITIVE_TOPOLOGY_LINE_STRIP = 2,
    VK_PRIMITIVE_TOPOLOGY_TRIANGLE_LIST = 3,
    VK_PRIMITIVE_TOPOLOGY_TRIANGLE_STRIP = 4,
    VK_PRIMITIVE_TOPOLOGY_TRIANGLE_FAN = 5,
    VK_PRIMITIVE_TOPOLOGY_LINE_LIST_WITH_ADJACENCY = 6,
    VK_PRIMITIVE_TOPOLOGY_LINE_STRIP_WITH_ADJACENCY = 7,
    VK_PRIMITIVE_TOPOLOGY_TRIANGLE_LIST_WITH_ADJACENCY = 8,
    VK_PRIMITIVE_TOPOLOGY_TRIANGLE_STRIP_WITH_ADJACENCY = 9,
    VK_PRIMITIVE_TOPOLOGY_PATCH_LIST = 10,
    VK_PRIMITIVE_TOPOLOGY_RANGE_SIZE = 11,
    VK_PRIMITIVE_TOPOLOGY_MAX_ENUM = 2147483647,
}
pub const VkPolygonMode_VK_POLYGON_MODE_BEGIN_RANGE: VkPolygonMode =
    VkPolygonMode::VK_POLYGON_MODE_FILL;
pub const VkPolygonMode_VK_POLYGON_MODE_END_RANGE: VkPolygonMode =
    VkPolygonMode::VK_POLYGON_MODE_POINT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPolygonMode {
    VK_POLYGON_MODE_FILL = 0,
    VK_POLYGON_MODE_LINE = 1,
    VK_POLYGON_MODE_POINT = 2,
    VK_POLYGON_MODE_FILL_RECTANGLE_NV = 1000153000,
    VK_POLYGON_MODE_RANGE_SIZE = 3,
    VK_POLYGON_MODE_MAX_ENUM = 2147483647,
}
pub const VkFrontFace_VK_FRONT_FACE_BEGIN_RANGE: VkFrontFace =
    VkFrontFace::VK_FRONT_FACE_COUNTER_CLOCKWISE;
pub const VkFrontFace_VK_FRONT_FACE_END_RANGE: VkFrontFace =
    VkFrontFace::VK_FRONT_FACE_CLOCKWISE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkFrontFace {
    VK_FRONT_FACE_COUNTER_CLOCKWISE = 0,
    VK_FRONT_FACE_CLOCKWISE = 1,
    VK_FRONT_FACE_RANGE_SIZE = 2,
    VK_FRONT_FACE_MAX_ENUM = 2147483647,
}
pub const VkCompareOp_VK_COMPARE_OP_BEGIN_RANGE: VkCompareOp =
    VkCompareOp::VK_COMPARE_OP_NEVER;
pub const VkCompareOp_VK_COMPARE_OP_END_RANGE: VkCompareOp =
    VkCompareOp::VK_COMPARE_OP_ALWAYS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCompareOp {
    VK_COMPARE_OP_NEVER = 0,
    VK_COMPARE_OP_LESS = 1,
    VK_COMPARE_OP_EQUAL = 2,
    VK_COMPARE_OP_LESS_OR_EQUAL = 3,
    VK_COMPARE_OP_GREATER = 4,
    VK_COMPARE_OP_NOT_EQUAL = 5,
    VK_COMPARE_OP_GREATER_OR_EQUAL = 6,
    VK_COMPARE_OP_ALWAYS = 7,
    VK_COMPARE_OP_RANGE_SIZE = 8,
    VK_COMPARE_OP_MAX_ENUM = 2147483647,
}
pub const VkStencilOp_VK_STENCIL_OP_BEGIN_RANGE: VkStencilOp =
    VkStencilOp::VK_STENCIL_OP_KEEP;
pub const VkStencilOp_VK_STENCIL_OP_END_RANGE: VkStencilOp =
    VkStencilOp::VK_STENCIL_OP_DECREMENT_AND_WRAP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkStencilOp {
    VK_STENCIL_OP_KEEP = 0,
    VK_STENCIL_OP_ZERO = 1,
    VK_STENCIL_OP_REPLACE = 2,
    VK_STENCIL_OP_INCREMENT_AND_CLAMP = 3,
    VK_STENCIL_OP_DECREMENT_AND_CLAMP = 4,
    VK_STENCIL_OP_INVERT = 5,
    VK_STENCIL_OP_INCREMENT_AND_WRAP = 6,
    VK_STENCIL_OP_DECREMENT_AND_WRAP = 7,
    VK_STENCIL_OP_RANGE_SIZE = 8,
    VK_STENCIL_OP_MAX_ENUM = 2147483647,
}
pub const VkLogicOp_VK_LOGIC_OP_BEGIN_RANGE: VkLogicOp =
    VkLogicOp::VK_LOGIC_OP_CLEAR;
pub const VkLogicOp_VK_LOGIC_OP_END_RANGE: VkLogicOp =
    VkLogicOp::VK_LOGIC_OP_SET;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkLogicOp {
    VK_LOGIC_OP_CLEAR = 0,
    VK_LOGIC_OP_AND = 1,
    VK_LOGIC_OP_AND_REVERSE = 2,
    VK_LOGIC_OP_COPY = 3,
    VK_LOGIC_OP_AND_INVERTED = 4,
    VK_LOGIC_OP_NO_OP = 5,
    VK_LOGIC_OP_XOR = 6,
    VK_LOGIC_OP_OR = 7,
    VK_LOGIC_OP_NOR = 8,
    VK_LOGIC_OP_EQUIVALENT = 9,
    VK_LOGIC_OP_INVERT = 10,
    VK_LOGIC_OP_OR_REVERSE = 11,
    VK_LOGIC_OP_COPY_INVERTED = 12,
    VK_LOGIC_OP_OR_INVERTED = 13,
    VK_LOGIC_OP_NAND = 14,
    VK_LOGIC_OP_SET = 15,
    VK_LOGIC_OP_RANGE_SIZE = 16,
    VK_LOGIC_OP_MAX_ENUM = 2147483647,
}
pub const VkBlendFactor_VK_BLEND_FACTOR_BEGIN_RANGE: VkBlendFactor =
    VkBlendFactor::VK_BLEND_FACTOR_ZERO;
pub const VkBlendFactor_VK_BLEND_FACTOR_END_RANGE: VkBlendFactor =
    VkBlendFactor::VK_BLEND_FACTOR_ONE_MINUS_SRC1_ALPHA;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkBlendFactor {
    VK_BLEND_FACTOR_ZERO = 0,
    VK_BLEND_FACTOR_ONE = 1,
    VK_BLEND_FACTOR_SRC_COLOR = 2,
    VK_BLEND_FACTOR_ONE_MINUS_SRC_COLOR = 3,
    VK_BLEND_FACTOR_DST_COLOR = 4,
    VK_BLEND_FACTOR_ONE_MINUS_DST_COLOR = 5,
    VK_BLEND_FACTOR_SRC_ALPHA = 6,
    VK_BLEND_FACTOR_ONE_MINUS_SRC_ALPHA = 7,
    VK_BLEND_FACTOR_DST_ALPHA = 8,
    VK_BLEND_FACTOR_ONE_MINUS_DST_ALPHA = 9,
    VK_BLEND_FACTOR_CONSTANT_COLOR = 10,
    VK_BLEND_FACTOR_ONE_MINUS_CONSTANT_COLOR = 11,
    VK_BLEND_FACTOR_CONSTANT_ALPHA = 12,
    VK_BLEND_FACTOR_ONE_MINUS_CONSTANT_ALPHA = 13,
    VK_BLEND_FACTOR_SRC_ALPHA_SATURATE = 14,
    VK_BLEND_FACTOR_SRC1_COLOR = 15,
    VK_BLEND_FACTOR_ONE_MINUS_SRC1_COLOR = 16,
    VK_BLEND_FACTOR_SRC1_ALPHA = 17,
    VK_BLEND_FACTOR_ONE_MINUS_SRC1_ALPHA = 18,
    VK_BLEND_FACTOR_RANGE_SIZE = 19,
    VK_BLEND_FACTOR_MAX_ENUM = 2147483647,
}
pub const VkBlendOp_VK_BLEND_OP_BEGIN_RANGE: VkBlendOp =
    VkBlendOp::VK_BLEND_OP_ADD;
pub const VkBlendOp_VK_BLEND_OP_END_RANGE: VkBlendOp =
    VkBlendOp::VK_BLEND_OP_MAX;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkBlendOp {
    VK_BLEND_OP_ADD = 0,
    VK_BLEND_OP_SUBTRACT = 1,
    VK_BLEND_OP_REVERSE_SUBTRACT = 2,
    VK_BLEND_OP_MIN = 3,
    VK_BLEND_OP_MAX = 4,
    VK_BLEND_OP_ZERO_EXT = 1000148000,
    VK_BLEND_OP_SRC_EXT = 1000148001,
    VK_BLEND_OP_DST_EXT = 1000148002,
    VK_BLEND_OP_SRC_OVER_EXT = 1000148003,
    VK_BLEND_OP_DST_OVER_EXT = 1000148004,
    VK_BLEND_OP_SRC_IN_EXT = 1000148005,
    VK_BLEND_OP_DST_IN_EXT = 1000148006,
    VK_BLEND_OP_SRC_OUT_EXT = 1000148007,
    VK_BLEND_OP_DST_OUT_EXT = 1000148008,
    VK_BLEND_OP_SRC_ATOP_EXT = 1000148009,
    VK_BLEND_OP_DST_ATOP_EXT = 1000148010,
    VK_BLEND_OP_XOR_EXT = 1000148011,
    VK_BLEND_OP_MULTIPLY_EXT = 1000148012,
    VK_BLEND_OP_SCREEN_EXT = 1000148013,
    VK_BLEND_OP_OVERLAY_EXT = 1000148014,
    VK_BLEND_OP_DARKEN_EXT = 1000148015,
    VK_BLEND_OP_LIGHTEN_EXT = 1000148016,
    VK_BLEND_OP_COLORDODGE_EXT = 1000148017,
    VK_BLEND_OP_COLORBURN_EXT = 1000148018,
    VK_BLEND_OP_HARDLIGHT_EXT = 1000148019,
    VK_BLEND_OP_SOFTLIGHT_EXT = 1000148020,
    VK_BLEND_OP_DIFFERENCE_EXT = 1000148021,
    VK_BLEND_OP_EXCLUSION_EXT = 1000148022,
    VK_BLEND_OP_INVERT_EXT = 1000148023,
    VK_BLEND_OP_INVERT_RGB_EXT = 1000148024,
    VK_BLEND_OP_LINEARDODGE_EXT = 1000148025,
    VK_BLEND_OP_LINEARBURN_EXT = 1000148026,
    VK_BLEND_OP_VIVIDLIGHT_EXT = 1000148027,
    VK_BLEND_OP_LINEARLIGHT_EXT = 1000148028,
    VK_BLEND_OP_PINLIGHT_EXT = 1000148029,
    VK_BLEND_OP_HARDMIX_EXT = 1000148030,
    VK_BLEND_OP_HSL_HUE_EXT = 1000148031,
    VK_BLEND_OP_HSL_SATURATION_EXT = 1000148032,
    VK_BLEND_OP_HSL_COLOR_EXT = 1000148033,
    VK_BLEND_OP_HSL_LUMINOSITY_EXT = 1000148034,
    VK_BLEND_OP_PLUS_EXT = 1000148035,
    VK_BLEND_OP_PLUS_CLAMPED_EXT = 1000148036,
    VK_BLEND_OP_PLUS_CLAMPED_ALPHA_EXT = 1000148037,
    VK_BLEND_OP_PLUS_DARKER_EXT = 1000148038,
    VK_BLEND_OP_MINUS_EXT = 1000148039,
    VK_BLEND_OP_MINUS_CLAMPED_EXT = 1000148040,
    VK_BLEND_OP_CONTRAST_EXT = 1000148041,
    VK_BLEND_OP_INVERT_OVG_EXT = 1000148042,
    VK_BLEND_OP_RED_EXT = 1000148043,
    VK_BLEND_OP_GREEN_EXT = 1000148044,
    VK_BLEND_OP_BLUE_EXT = 1000148045,
    VK_BLEND_OP_RANGE_SIZE = 5,
    VK_BLEND_OP_MAX_ENUM = 2147483647,
}
pub const VkDynamicState_VK_DYNAMIC_STATE_BEGIN_RANGE: VkDynamicState =
    VkDynamicState::VK_DYNAMIC_STATE_VIEWPORT;
pub const VkDynamicState_VK_DYNAMIC_STATE_END_RANGE: VkDynamicState =
    VkDynamicState::VK_DYNAMIC_STATE_STENCIL_REFERENCE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkDynamicState {
    VK_DYNAMIC_STATE_VIEWPORT = 0,
    VK_DYNAMIC_STATE_SCISSOR = 1,
    VK_DYNAMIC_STATE_LINE_WIDTH = 2,
    VK_DYNAMIC_STATE_DEPTH_BIAS = 3,
    VK_DYNAMIC_STATE_BLEND_CONSTANTS = 4,
    VK_DYNAMIC_STATE_DEPTH_BOUNDS = 5,
    VK_DYNAMIC_STATE_STENCIL_COMPARE_MASK = 6,
    VK_DYNAMIC_STATE_STENCIL_WRITE_MASK = 7,
    VK_DYNAMIC_STATE_STENCIL_REFERENCE = 8,
    VK_DYNAMIC_STATE_VIEWPORT_W_SCALING_NV = 1000087000,
    VK_DYNAMIC_STATE_DISCARD_RECTANGLE_EXT = 1000099000,
    VK_DYNAMIC_STATE_RANGE_SIZE = 9,
    VK_DYNAMIC_STATE_MAX_ENUM = 2147483647,
}
pub const VkFilter_VK_FILTER_BEGIN_RANGE: VkFilter =
    VkFilter::VK_FILTER_NEAREST;
pub const VkFilter_VK_FILTER_END_RANGE: VkFilter = VkFilter::VK_FILTER_LINEAR;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkFilter {
    VK_FILTER_NEAREST = 0,
    VK_FILTER_LINEAR = 1,
    VK_FILTER_CUBIC_IMG = 1000015000,
    VK_FILTER_RANGE_SIZE = 2,
    VK_FILTER_MAX_ENUM = 2147483647,
}
pub const VkSamplerMipmapMode_VK_SAMPLER_MIPMAP_MODE_BEGIN_RANGE:
          VkSamplerMipmapMode =
    VkSamplerMipmapMode::VK_SAMPLER_MIPMAP_MODE_NEAREST;
pub const VkSamplerMipmapMode_VK_SAMPLER_MIPMAP_MODE_END_RANGE:
          VkSamplerMipmapMode =
    VkSamplerMipmapMode::VK_SAMPLER_MIPMAP_MODE_LINEAR;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSamplerMipmapMode {
    VK_SAMPLER_MIPMAP_MODE_NEAREST = 0,
    VK_SAMPLER_MIPMAP_MODE_LINEAR = 1,
    VK_SAMPLER_MIPMAP_MODE_RANGE_SIZE = 2,
    VK_SAMPLER_MIPMAP_MODE_MAX_ENUM = 2147483647,
}
pub const VkSamplerAddressMode_VK_SAMPLER_ADDRESS_MODE_BEGIN_RANGE:
          VkSamplerAddressMode =
    VkSamplerAddressMode::VK_SAMPLER_ADDRESS_MODE_REPEAT;
pub const VkSamplerAddressMode_VK_SAMPLER_ADDRESS_MODE_END_RANGE:
          VkSamplerAddressMode =
    VkSamplerAddressMode::VK_SAMPLER_ADDRESS_MODE_CLAMP_TO_BORDER;
pub const VkSamplerAddressMode_VK_SAMPLER_ADDRESS_MODE_RANGE_SIZE:
          VkSamplerAddressMode =
    VkSamplerAddressMode::VK_SAMPLER_ADDRESS_MODE_MIRROR_CLAMP_TO_EDGE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSamplerAddressMode {
    VK_SAMPLER_ADDRESS_MODE_REPEAT = 0,
    VK_SAMPLER_ADDRESS_MODE_MIRRORED_REPEAT = 1,
    VK_SAMPLER_ADDRESS_MODE_CLAMP_TO_EDGE = 2,
    VK_SAMPLER_ADDRESS_MODE_CLAMP_TO_BORDER = 3,
    VK_SAMPLER_ADDRESS_MODE_MIRROR_CLAMP_TO_EDGE = 4,
    VK_SAMPLER_ADDRESS_MODE_MAX_ENUM = 2147483647,
}
pub const VkBorderColor_VK_BORDER_COLOR_BEGIN_RANGE: VkBorderColor =
    VkBorderColor::VK_BORDER_COLOR_FLOAT_TRANSPARENT_BLACK;
pub const VkBorderColor_VK_BORDER_COLOR_END_RANGE: VkBorderColor =
    VkBorderColor::VK_BORDER_COLOR_INT_OPAQUE_WHITE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkBorderColor {
    VK_BORDER_COLOR_FLOAT_TRANSPARENT_BLACK = 0,
    VK_BORDER_COLOR_INT_TRANSPARENT_BLACK = 1,
    VK_BORDER_COLOR_FLOAT_OPAQUE_BLACK = 2,
    VK_BORDER_COLOR_INT_OPAQUE_BLACK = 3,
    VK_BORDER_COLOR_FLOAT_OPAQUE_WHITE = 4,
    VK_BORDER_COLOR_INT_OPAQUE_WHITE = 5,
    VK_BORDER_COLOR_RANGE_SIZE = 6,
    VK_BORDER_COLOR_MAX_ENUM = 2147483647,
}
pub const VkDescriptorType_VK_DESCRIPTOR_TYPE_BEGIN_RANGE: VkDescriptorType =
    VkDescriptorType::VK_DESCRIPTOR_TYPE_SAMPLER;
pub const VkDescriptorType_VK_DESCRIPTOR_TYPE_END_RANGE: VkDescriptorType =
    VkDescriptorType::VK_DESCRIPTOR_TYPE_INPUT_ATTACHMENT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkDescriptorType {
    VK_DESCRIPTOR_TYPE_SAMPLER = 0,
    VK_DESCRIPTOR_TYPE_COMBINED_IMAGE_SAMPLER = 1,
    VK_DESCRIPTOR_TYPE_SAMPLED_IMAGE = 2,
    VK_DESCRIPTOR_TYPE_STORAGE_IMAGE = 3,
    VK_DESCRIPTOR_TYPE_UNIFORM_TEXEL_BUFFER = 4,
    VK_DESCRIPTOR_TYPE_STORAGE_TEXEL_BUFFER = 5,
    VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER = 6,
    VK_DESCRIPTOR_TYPE_STORAGE_BUFFER = 7,
    VK_DESCRIPTOR_TYPE_UNIFORM_BUFFER_DYNAMIC = 8,
    VK_DESCRIPTOR_TYPE_STORAGE_BUFFER_DYNAMIC = 9,
    VK_DESCRIPTOR_TYPE_INPUT_ATTACHMENT = 10,
    VK_DESCRIPTOR_TYPE_RANGE_SIZE = 11,
    VK_DESCRIPTOR_TYPE_MAX_ENUM = 2147483647,
}
pub const VkAttachmentLoadOp_VK_ATTACHMENT_LOAD_OP_BEGIN_RANGE:
          VkAttachmentLoadOp =
    VkAttachmentLoadOp::VK_ATTACHMENT_LOAD_OP_LOAD;
pub const VkAttachmentLoadOp_VK_ATTACHMENT_LOAD_OP_END_RANGE:
          VkAttachmentLoadOp =
    VkAttachmentLoadOp::VK_ATTACHMENT_LOAD_OP_DONT_CARE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkAttachmentLoadOp {
    VK_ATTACHMENT_LOAD_OP_LOAD = 0,
    VK_ATTACHMENT_LOAD_OP_CLEAR = 1,
    VK_ATTACHMENT_LOAD_OP_DONT_CARE = 2,
    VK_ATTACHMENT_LOAD_OP_RANGE_SIZE = 3,
    VK_ATTACHMENT_LOAD_OP_MAX_ENUM = 2147483647,
}
pub const VkAttachmentStoreOp_VK_ATTACHMENT_STORE_OP_BEGIN_RANGE:
          VkAttachmentStoreOp =
    VkAttachmentStoreOp::VK_ATTACHMENT_STORE_OP_STORE;
pub const VkAttachmentStoreOp_VK_ATTACHMENT_STORE_OP_END_RANGE:
          VkAttachmentStoreOp =
    VkAttachmentStoreOp::VK_ATTACHMENT_STORE_OP_DONT_CARE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkAttachmentStoreOp {
    VK_ATTACHMENT_STORE_OP_STORE = 0,
    VK_ATTACHMENT_STORE_OP_DONT_CARE = 1,
    VK_ATTACHMENT_STORE_OP_RANGE_SIZE = 2,
    VK_ATTACHMENT_STORE_OP_MAX_ENUM = 2147483647,
}
pub const VkPipelineBindPoint_VK_PIPELINE_BIND_POINT_BEGIN_RANGE:
          VkPipelineBindPoint =
    VkPipelineBindPoint::VK_PIPELINE_BIND_POINT_GRAPHICS;
pub const VkPipelineBindPoint_VK_PIPELINE_BIND_POINT_END_RANGE:
          VkPipelineBindPoint =
    VkPipelineBindPoint::VK_PIPELINE_BIND_POINT_COMPUTE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPipelineBindPoint {
    VK_PIPELINE_BIND_POINT_GRAPHICS = 0,
    VK_PIPELINE_BIND_POINT_COMPUTE = 1,
    VK_PIPELINE_BIND_POINT_RANGE_SIZE = 2,
    VK_PIPELINE_BIND_POINT_MAX_ENUM = 2147483647,
}
pub const VkCommandBufferLevel_VK_COMMAND_BUFFER_LEVEL_BEGIN_RANGE:
          VkCommandBufferLevel =
    VkCommandBufferLevel::VK_COMMAND_BUFFER_LEVEL_PRIMARY;
pub const VkCommandBufferLevel_VK_COMMAND_BUFFER_LEVEL_END_RANGE:
          VkCommandBufferLevel =
    VkCommandBufferLevel::VK_COMMAND_BUFFER_LEVEL_SECONDARY;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCommandBufferLevel {
    VK_COMMAND_BUFFER_LEVEL_PRIMARY = 0,
    VK_COMMAND_BUFFER_LEVEL_SECONDARY = 1,
    VK_COMMAND_BUFFER_LEVEL_RANGE_SIZE = 2,
    VK_COMMAND_BUFFER_LEVEL_MAX_ENUM = 2147483647,
}
pub const VkIndexType_VK_INDEX_TYPE_BEGIN_RANGE: VkIndexType =
    VkIndexType::VK_INDEX_TYPE_UINT16;
pub const VkIndexType_VK_INDEX_TYPE_END_RANGE: VkIndexType =
    VkIndexType::VK_INDEX_TYPE_UINT32;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkIndexType {
    VK_INDEX_TYPE_UINT16 = 0,
    VK_INDEX_TYPE_UINT32 = 1,
    VK_INDEX_TYPE_RANGE_SIZE = 2,
    VK_INDEX_TYPE_MAX_ENUM = 2147483647,
}
pub const VkSubpassContents_VK_SUBPASS_CONTENTS_BEGIN_RANGE: VkSubpassContents
          =
    VkSubpassContents::VK_SUBPASS_CONTENTS_INLINE;
pub const VkSubpassContents_VK_SUBPASS_CONTENTS_END_RANGE: VkSubpassContents =
    VkSubpassContents::VK_SUBPASS_CONTENTS_SECONDARY_COMMAND_BUFFERS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSubpassContents {
    VK_SUBPASS_CONTENTS_INLINE = 0,
    VK_SUBPASS_CONTENTS_SECONDARY_COMMAND_BUFFERS = 1,
    VK_SUBPASS_CONTENTS_RANGE_SIZE = 2,
    VK_SUBPASS_CONTENTS_MAX_ENUM = 2147483647,
}
pub const VkObjectType_VK_OBJECT_TYPE_BEGIN_RANGE: VkObjectType =
    VkObjectType::VK_OBJECT_TYPE_UNKNOWN;
pub const VkObjectType_VK_OBJECT_TYPE_END_RANGE: VkObjectType =
    VkObjectType::VK_OBJECT_TYPE_COMMAND_POOL;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkObjectType {
    VK_OBJECT_TYPE_UNKNOWN = 0,
    VK_OBJECT_TYPE_INSTANCE = 1,
    VK_OBJECT_TYPE_PHYSICAL_DEVICE = 2,
    VK_OBJECT_TYPE_DEVICE = 3,
    VK_OBJECT_TYPE_QUEUE = 4,
    VK_OBJECT_TYPE_SEMAPHORE = 5,
    VK_OBJECT_TYPE_COMMAND_BUFFER = 6,
    VK_OBJECT_TYPE_FENCE = 7,
    VK_OBJECT_TYPE_DEVICE_MEMORY = 8,
    VK_OBJECT_TYPE_BUFFER = 9,
    VK_OBJECT_TYPE_IMAGE = 10,
    VK_OBJECT_TYPE_EVENT = 11,
    VK_OBJECT_TYPE_QUERY_POOL = 12,
    VK_OBJECT_TYPE_BUFFER_VIEW = 13,
    VK_OBJECT_TYPE_IMAGE_VIEW = 14,
    VK_OBJECT_TYPE_SHADER_MODULE = 15,
    VK_OBJECT_TYPE_PIPELINE_CACHE = 16,
    VK_OBJECT_TYPE_PIPELINE_LAYOUT = 17,
    VK_OBJECT_TYPE_RENDER_PASS = 18,
    VK_OBJECT_TYPE_PIPELINE = 19,
    VK_OBJECT_TYPE_DESCRIPTOR_SET_LAYOUT = 20,
    VK_OBJECT_TYPE_SAMPLER = 21,
    VK_OBJECT_TYPE_DESCRIPTOR_POOL = 22,
    VK_OBJECT_TYPE_DESCRIPTOR_SET = 23,
    VK_OBJECT_TYPE_FRAMEBUFFER = 24,
    VK_OBJECT_TYPE_COMMAND_POOL = 25,
    VK_OBJECT_TYPE_SURFACE_KHR = 1000000000,
    VK_OBJECT_TYPE_SWAPCHAIN_KHR = 1000001000,
    VK_OBJECT_TYPE_DISPLAY_KHR = 1000002000,
    VK_OBJECT_TYPE_DISPLAY_MODE_KHR = 1000002001,
    VK_OBJECT_TYPE_DEBUG_REPORT_CALLBACK_EXT = 1000011000,
    VK_OBJECT_TYPE_DESCRIPTOR_UPDATE_TEMPLATE_KHR = 1000085000,
    VK_OBJECT_TYPE_OBJECT_TABLE_NVX = 1000086000,
    VK_OBJECT_TYPE_INDIRECT_COMMANDS_LAYOUT_NVX = 1000086001,
    VK_OBJECT_TYPE_RANGE_SIZE = 26,
    VK_OBJECT_TYPE_MAX_ENUM = 2147483647,
}
pub type VkInstanceCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkFormatFeatureFlagBits {
    VK_FORMAT_FEATURE_SAMPLED_IMAGE_BIT = 1,
    VK_FORMAT_FEATURE_STORAGE_IMAGE_BIT = 2,
    VK_FORMAT_FEATURE_STORAGE_IMAGE_ATOMIC_BIT = 4,
    VK_FORMAT_FEATURE_UNIFORM_TEXEL_BUFFER_BIT = 8,
    VK_FORMAT_FEATURE_STORAGE_TEXEL_BUFFER_BIT = 16,
    VK_FORMAT_FEATURE_STORAGE_TEXEL_BUFFER_ATOMIC_BIT = 32,
    VK_FORMAT_FEATURE_VERTEX_BUFFER_BIT = 64,
    VK_FORMAT_FEATURE_COLOR_ATTACHMENT_BIT = 128,
    VK_FORMAT_FEATURE_COLOR_ATTACHMENT_BLEND_BIT = 256,
    VK_FORMAT_FEATURE_DEPTH_STENCIL_ATTACHMENT_BIT = 512,
    VK_FORMAT_FEATURE_BLIT_SRC_BIT = 1024,
    VK_FORMAT_FEATURE_BLIT_DST_BIT = 2048,
    VK_FORMAT_FEATURE_SAMPLED_IMAGE_FILTER_LINEAR_BIT = 4096,
    VK_FORMAT_FEATURE_SAMPLED_IMAGE_FILTER_CUBIC_BIT_IMG = 8192,
    VK_FORMAT_FEATURE_TRANSFER_SRC_BIT_KHR = 16384,
    VK_FORMAT_FEATURE_TRANSFER_DST_BIT_KHR = 32768,
    VK_FORMAT_FEATURE_SAMPLED_IMAGE_FILTER_MINMAX_BIT_EXT = 65536,
    VK_FORMAT_FEATURE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkFormatFeatureFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageUsageFlagBits {
    VK_IMAGE_USAGE_TRANSFER_SRC_BIT = 1,
    VK_IMAGE_USAGE_TRANSFER_DST_BIT = 2,
    VK_IMAGE_USAGE_SAMPLED_BIT = 4,
    VK_IMAGE_USAGE_STORAGE_BIT = 8,
    VK_IMAGE_USAGE_COLOR_ATTACHMENT_BIT = 16,
    VK_IMAGE_USAGE_DEPTH_STENCIL_ATTACHMENT_BIT = 32,
    VK_IMAGE_USAGE_TRANSIENT_ATTACHMENT_BIT = 64,
    VK_IMAGE_USAGE_INPUT_ATTACHMENT_BIT = 128,
    VK_IMAGE_USAGE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkImageUsageFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageCreateFlagBits {
    VK_IMAGE_CREATE_SPARSE_BINDING_BIT = 1,
    VK_IMAGE_CREATE_SPARSE_RESIDENCY_BIT = 2,
    VK_IMAGE_CREATE_SPARSE_ALIASED_BIT = 4,
    VK_IMAGE_CREATE_MUTABLE_FORMAT_BIT = 8,
    VK_IMAGE_CREATE_CUBE_COMPATIBLE_BIT = 16,
    VK_IMAGE_CREATE_BIND_SFR_BIT_KHX = 64,
    VK_IMAGE_CREATE_2D_ARRAY_COMPATIBLE_BIT_KHR = 32,
    VK_IMAGE_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkImageCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSampleCountFlagBits {
    VK_SAMPLE_COUNT_1_BIT = 1,
    VK_SAMPLE_COUNT_2_BIT = 2,
    VK_SAMPLE_COUNT_4_BIT = 4,
    VK_SAMPLE_COUNT_8_BIT = 8,
    VK_SAMPLE_COUNT_16_BIT = 16,
    VK_SAMPLE_COUNT_32_BIT = 32,
    VK_SAMPLE_COUNT_64_BIT = 64,
    VK_SAMPLE_COUNT_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkSampleCountFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkQueueFlagBits {
    VK_QUEUE_GRAPHICS_BIT = 1,
    VK_QUEUE_COMPUTE_BIT = 2,
    VK_QUEUE_TRANSFER_BIT = 4,
    VK_QUEUE_SPARSE_BINDING_BIT = 8,
    VK_QUEUE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkQueueFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkMemoryPropertyFlagBits {
    VK_MEMORY_PROPERTY_DEVICE_LOCAL_BIT = 1,
    VK_MEMORY_PROPERTY_HOST_VISIBLE_BIT = 2,
    VK_MEMORY_PROPERTY_HOST_COHERENT_BIT = 4,
    VK_MEMORY_PROPERTY_HOST_CACHED_BIT = 8,
    VK_MEMORY_PROPERTY_LAZILY_ALLOCATED_BIT = 16,
    VK_MEMORY_PROPERTY_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkMemoryPropertyFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkMemoryHeapFlagBits {
    VK_MEMORY_HEAP_DEVICE_LOCAL_BIT = 1,
    VK_MEMORY_HEAP_MULTI_INSTANCE_BIT_KHX = 2,
    VK_MEMORY_HEAP_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkMemoryHeapFlags = VkFlags;
pub type VkDeviceCreateFlags = VkFlags;
pub type VkDeviceQueueCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPipelineStageFlagBits {
    VK_PIPELINE_STAGE_TOP_OF_PIPE_BIT = 1,
    VK_PIPELINE_STAGE_DRAW_INDIRECT_BIT = 2,
    VK_PIPELINE_STAGE_VERTEX_INPUT_BIT = 4,
    VK_PIPELINE_STAGE_VERTEX_SHADER_BIT = 8,
    VK_PIPELINE_STAGE_TESSELLATION_CONTROL_SHADER_BIT = 16,
    VK_PIPELINE_STAGE_TESSELLATION_EVALUATION_SHADER_BIT = 32,
    VK_PIPELINE_STAGE_GEOMETRY_SHADER_BIT = 64,
    VK_PIPELINE_STAGE_FRAGMENT_SHADER_BIT = 128,
    VK_PIPELINE_STAGE_EARLY_FRAGMENT_TESTS_BIT = 256,
    VK_PIPELINE_STAGE_LATE_FRAGMENT_TESTS_BIT = 512,
    VK_PIPELINE_STAGE_COLOR_ATTACHMENT_OUTPUT_BIT = 1024,
    VK_PIPELINE_STAGE_COMPUTE_SHADER_BIT = 2048,
    VK_PIPELINE_STAGE_TRANSFER_BIT = 4096,
    VK_PIPELINE_STAGE_BOTTOM_OF_PIPE_BIT = 8192,
    VK_PIPELINE_STAGE_HOST_BIT = 16384,
    VK_PIPELINE_STAGE_ALL_GRAPHICS_BIT = 32768,
    VK_PIPELINE_STAGE_ALL_COMMANDS_BIT = 65536,
    VK_PIPELINE_STAGE_COMMAND_PROCESS_BIT_NVX = 131072,
    VK_PIPELINE_STAGE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkPipelineStageFlags = VkFlags;
pub type VkMemoryMapFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkImageAspectFlagBits {
    VK_IMAGE_ASPECT_COLOR_BIT = 1,
    VK_IMAGE_ASPECT_DEPTH_BIT = 2,
    VK_IMAGE_ASPECT_STENCIL_BIT = 4,
    VK_IMAGE_ASPECT_METADATA_BIT = 8,
    VK_IMAGE_ASPECT_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkImageAspectFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSparseImageFormatFlagBits {
    VK_SPARSE_IMAGE_FORMAT_SINGLE_MIPTAIL_BIT = 1,
    VK_SPARSE_IMAGE_FORMAT_ALIGNED_MIP_SIZE_BIT = 2,
    VK_SPARSE_IMAGE_FORMAT_NONSTANDARD_BLOCK_SIZE_BIT = 4,
    VK_SPARSE_IMAGE_FORMAT_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkSparseImageFormatFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSparseMemoryBindFlagBits {
    VK_SPARSE_MEMORY_BIND_METADATA_BIT = 1,
    VK_SPARSE_MEMORY_BIND_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkSparseMemoryBindFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkFenceCreateFlagBits {
    VK_FENCE_CREATE_SIGNALED_BIT = 1,
    VK_FENCE_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkFenceCreateFlags = VkFlags;
pub type VkSemaphoreCreateFlags = VkFlags;
pub type VkEventCreateFlags = VkFlags;
pub type VkQueryPoolCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkQueryPipelineStatisticFlagBits {
    VK_QUERY_PIPELINE_STATISTIC_INPUT_ASSEMBLY_VERTICES_BIT = 1,
    VK_QUERY_PIPELINE_STATISTIC_INPUT_ASSEMBLY_PRIMITIVES_BIT = 2,
    VK_QUERY_PIPELINE_STATISTIC_VERTEX_SHADER_INVOCATIONS_BIT = 4,
    VK_QUERY_PIPELINE_STATISTIC_GEOMETRY_SHADER_INVOCATIONS_BIT = 8,
    VK_QUERY_PIPELINE_STATISTIC_GEOMETRY_SHADER_PRIMITIVES_BIT = 16,
    VK_QUERY_PIPELINE_STATISTIC_CLIPPING_INVOCATIONS_BIT = 32,
    VK_QUERY_PIPELINE_STATISTIC_CLIPPING_PRIMITIVES_BIT = 64,
    VK_QUERY_PIPELINE_STATISTIC_FRAGMENT_SHADER_INVOCATIONS_BIT = 128,
    VK_QUERY_PIPELINE_STATISTIC_TESSELLATION_CONTROL_SHADER_PATCHES_BIT = 256,
    VK_QUERY_PIPELINE_STATISTIC_TESSELLATION_EVALUATION_SHADER_INVOCATIONS_BIT
        = 512,
    VK_QUERY_PIPELINE_STATISTIC_COMPUTE_SHADER_INVOCATIONS_BIT = 1024,
    VK_QUERY_PIPELINE_STATISTIC_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkQueryPipelineStatisticFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkQueryResultFlagBits {
    VK_QUERY_RESULT_64_BIT = 1,
    VK_QUERY_RESULT_WAIT_BIT = 2,
    VK_QUERY_RESULT_WITH_AVAILABILITY_BIT = 4,
    VK_QUERY_RESULT_PARTIAL_BIT = 8,
    VK_QUERY_RESULT_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkQueryResultFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkBufferCreateFlagBits {
    VK_BUFFER_CREATE_SPARSE_BINDING_BIT = 1,
    VK_BUFFER_CREATE_SPARSE_RESIDENCY_BIT = 2,
    VK_BUFFER_CREATE_SPARSE_ALIASED_BIT = 4,
    VK_BUFFER_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkBufferCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkBufferUsageFlagBits {
    VK_BUFFER_USAGE_TRANSFER_SRC_BIT = 1,
    VK_BUFFER_USAGE_TRANSFER_DST_BIT = 2,
    VK_BUFFER_USAGE_UNIFORM_TEXEL_BUFFER_BIT = 4,
    VK_BUFFER_USAGE_STORAGE_TEXEL_BUFFER_BIT = 8,
    VK_BUFFER_USAGE_UNIFORM_BUFFER_BIT = 16,
    VK_BUFFER_USAGE_STORAGE_BUFFER_BIT = 32,
    VK_BUFFER_USAGE_INDEX_BUFFER_BIT = 64,
    VK_BUFFER_USAGE_VERTEX_BUFFER_BIT = 128,
    VK_BUFFER_USAGE_INDIRECT_BUFFER_BIT = 256,
    VK_BUFFER_USAGE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkBufferUsageFlags = VkFlags;
pub type VkBufferViewCreateFlags = VkFlags;
pub type VkImageViewCreateFlags = VkFlags;
pub type VkShaderModuleCreateFlags = VkFlags;
pub type VkPipelineCacheCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkPipelineCreateFlagBits {
    VK_PIPELINE_CREATE_DISABLE_OPTIMIZATION_BIT = 1,
    VK_PIPELINE_CREATE_ALLOW_DERIVATIVES_BIT = 2,
    VK_PIPELINE_CREATE_DERIVATIVE_BIT = 4,
    VK_PIPELINE_CREATE_VIEW_INDEX_FROM_DEVICE_INDEX_BIT_KHX = 8,
    VK_PIPELINE_CREATE_DISPATCH_BASE_KHX = 16,
    VK_PIPELINE_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkPipelineCreateFlags = VkFlags;
pub type VkPipelineShaderStageCreateFlags = VkFlags;
pub const VkShaderStageFlagBits_VK_SHADER_STAGE_FLAG_BITS_MAX_ENUM:
          VkShaderStageFlagBits =
    VkShaderStageFlagBits::VK_SHADER_STAGE_ALL;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkShaderStageFlagBits {
    VK_SHADER_STAGE_VERTEX_BIT = 1,
    VK_SHADER_STAGE_TESSELLATION_CONTROL_BIT = 2,
    VK_SHADER_STAGE_TESSELLATION_EVALUATION_BIT = 4,
    VK_SHADER_STAGE_GEOMETRY_BIT = 8,
    VK_SHADER_STAGE_FRAGMENT_BIT = 16,
    VK_SHADER_STAGE_COMPUTE_BIT = 32,
    VK_SHADER_STAGE_ALL_GRAPHICS = 31,
    VK_SHADER_STAGE_ALL = 2147483647,
}
pub type VkPipelineVertexInputStateCreateFlags = VkFlags;
pub type VkPipelineInputAssemblyStateCreateFlags = VkFlags;
pub type VkPipelineTessellationStateCreateFlags = VkFlags;
pub type VkPipelineViewportStateCreateFlags = VkFlags;
pub type VkPipelineRasterizationStateCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCullModeFlagBits {
    VK_CULL_MODE_NONE = 0,
    VK_CULL_MODE_FRONT_BIT = 1,
    VK_CULL_MODE_BACK_BIT = 2,
    VK_CULL_MODE_FRONT_AND_BACK = 3,
    VK_CULL_MODE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkCullModeFlags = VkFlags;
pub type VkPipelineMultisampleStateCreateFlags = VkFlags;
pub type VkPipelineDepthStencilStateCreateFlags = VkFlags;
pub type VkPipelineColorBlendStateCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkColorComponentFlagBits {
    VK_COLOR_COMPONENT_R_BIT = 1,
    VK_COLOR_COMPONENT_G_BIT = 2,
    VK_COLOR_COMPONENT_B_BIT = 4,
    VK_COLOR_COMPONENT_A_BIT = 8,
    VK_COLOR_COMPONENT_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkColorComponentFlags = VkFlags;
pub type VkPipelineDynamicStateCreateFlags = VkFlags;
pub type VkPipelineLayoutCreateFlags = VkFlags;
pub type VkShaderStageFlags = VkFlags;
pub type VkSamplerCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkDescriptorSetLayoutCreateFlagBits {
    VK_DESCRIPTOR_SET_LAYOUT_CREATE_PUSH_DESCRIPTOR_BIT_KHR = 1,
    VK_DESCRIPTOR_SET_LAYOUT_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkDescriptorSetLayoutCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkDescriptorPoolCreateFlagBits {
    VK_DESCRIPTOR_POOL_CREATE_FREE_DESCRIPTOR_SET_BIT = 1,
    VK_DESCRIPTOR_POOL_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkDescriptorPoolCreateFlags = VkFlags;
pub type VkDescriptorPoolResetFlags = VkFlags;
pub type VkFramebufferCreateFlags = VkFlags;
pub type VkRenderPassCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkAttachmentDescriptionFlagBits {
    VK_ATTACHMENT_DESCRIPTION_MAY_ALIAS_BIT = 1,
    VK_ATTACHMENT_DESCRIPTION_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkAttachmentDescriptionFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkSubpassDescriptionFlagBits {
    VK_SUBPASS_DESCRIPTION_PER_VIEW_ATTRIBUTES_BIT_NVX = 1,
    VK_SUBPASS_DESCRIPTION_PER_VIEW_POSITION_X_ONLY_BIT_NVX = 2,
    VK_SUBPASS_DESCRIPTION_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkSubpassDescriptionFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkAccessFlagBits {
    VK_ACCESS_INDIRECT_COMMAND_READ_BIT = 1,
    VK_ACCESS_INDEX_READ_BIT = 2,
    VK_ACCESS_VERTEX_ATTRIBUTE_READ_BIT = 4,
    VK_ACCESS_UNIFORM_READ_BIT = 8,
    VK_ACCESS_INPUT_ATTACHMENT_READ_BIT = 16,
    VK_ACCESS_SHADER_READ_BIT = 32,
    VK_ACCESS_SHADER_WRITE_BIT = 64,
    VK_ACCESS_COLOR_ATTACHMENT_READ_BIT = 128,
    VK_ACCESS_COLOR_ATTACHMENT_WRITE_BIT = 256,
    VK_ACCESS_DEPTH_STENCIL_ATTACHMENT_READ_BIT = 512,
    VK_ACCESS_DEPTH_STENCIL_ATTACHMENT_WRITE_BIT = 1024,
    VK_ACCESS_TRANSFER_READ_BIT = 2048,
    VK_ACCESS_TRANSFER_WRITE_BIT = 4096,
    VK_ACCESS_HOST_READ_BIT = 8192,
    VK_ACCESS_HOST_WRITE_BIT = 16384,
    VK_ACCESS_MEMORY_READ_BIT = 32768,
    VK_ACCESS_MEMORY_WRITE_BIT = 65536,
    VK_ACCESS_COMMAND_PROCESS_READ_BIT_NVX = 131072,
    VK_ACCESS_COMMAND_PROCESS_WRITE_BIT_NVX = 262144,
    VK_ACCESS_COLOR_ATTACHMENT_READ_NONCOHERENT_BIT_EXT = 524288,
    VK_ACCESS_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkAccessFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkDependencyFlagBits {
    VK_DEPENDENCY_BY_REGION_BIT = 1,
    VK_DEPENDENCY_VIEW_LOCAL_BIT_KHX = 2,
    VK_DEPENDENCY_DEVICE_GROUP_BIT_KHX = 4,
    VK_DEPENDENCY_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkDependencyFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCommandPoolCreateFlagBits {
    VK_COMMAND_POOL_CREATE_TRANSIENT_BIT = 1,
    VK_COMMAND_POOL_CREATE_RESET_COMMAND_BUFFER_BIT = 2,
    VK_COMMAND_POOL_CREATE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkCommandPoolCreateFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCommandPoolResetFlagBits {
    VK_COMMAND_POOL_RESET_RELEASE_RESOURCES_BIT = 1,
    VK_COMMAND_POOL_RESET_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkCommandPoolResetFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCommandBufferUsageFlagBits {
    VK_COMMAND_BUFFER_USAGE_ONE_TIME_SUBMIT_BIT = 1,
    VK_COMMAND_BUFFER_USAGE_RENDER_PASS_CONTINUE_BIT = 2,
    VK_COMMAND_BUFFER_USAGE_SIMULTANEOUS_USE_BIT = 4,
    VK_COMMAND_BUFFER_USAGE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkCommandBufferUsageFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkQueryControlFlagBits {
    VK_QUERY_CONTROL_PRECISE_BIT = 1,
    VK_QUERY_CONTROL_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkQueryControlFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkCommandBufferResetFlagBits {
    VK_COMMAND_BUFFER_RESET_RELEASE_RESOURCES_BIT = 1,
    VK_COMMAND_BUFFER_RESET_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkCommandBufferResetFlags = VkFlags;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VkStencilFaceFlagBits {
    VK_STENCIL_FACE_FRONT_BIT = 1,
    VK_STENCIL_FACE_BACK_BIT = 2,
    VK_STENCIL_FRONT_AND_BACK = 3,
    VK_STENCIL_FACE_FLAG_BITS_MAX_ENUM = 2147483647,
}
pub type VkStencilFaceFlags = VkFlags;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkApplicationInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub pApplicationName: *const ::std::os::raw::c_char,
    pub applicationVersion: u32,
    pub pEngineName: *const ::std::os::raw::c_char,
    pub engineVersion: u32,
    pub apiVersion: u32,
}
#[test]
fn bindgen_test_layout_VkApplicationInfo() {
    assert_eq!(::std::mem::size_of::<VkApplicationInfo>() , 48usize , concat !
               ( "Size of: " , stringify ! ( VkApplicationInfo ) ));
    assert_eq! (::std::mem::align_of::<VkApplicationInfo>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkApplicationInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) . sType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) . pNext as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) . pApplicationName
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( pApplicationName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) .
                applicationVersion as * const _ as usize } , 24usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( applicationVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) . pEngineName as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( pEngineName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) . engineVersion as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( engineVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkApplicationInfo ) ) . apiVersion as *
                const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( VkApplicationInfo ) ,
                "::" , stringify ! ( apiVersion ) ));
}
impl Clone for VkApplicationInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkInstanceCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkInstanceCreateFlags,
    pub pApplicationInfo: *const VkApplicationInfo,
    pub enabledLayerCount: u32,
    pub ppEnabledLayerNames: *const *const ::std::os::raw::c_char,
    pub enabledExtensionCount: u32,
    pub ppEnabledExtensionNames: *const *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_VkInstanceCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkInstanceCreateInfo>() , 64usize ,
               concat ! ( "Size of: " , stringify ! ( VkInstanceCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkInstanceCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkInstanceCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) .
                pApplicationInfo as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( pApplicationInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) .
                enabledLayerCount as * const _ as usize } , 32usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( enabledLayerCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) .
                ppEnabledLayerNames as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( ppEnabledLayerNames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) .
                enabledExtensionCount as * const _ as usize } , 48usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( enabledExtensionCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkInstanceCreateInfo ) ) .
                ppEnabledExtensionNames as * const _ as usize } , 56usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkInstanceCreateInfo )
                , "::" , stringify ! ( ppEnabledExtensionNames ) ));
}
impl Clone for VkInstanceCreateInfo {
    fn clone(&self) -> Self { *self }
}
pub type PFN_vkAllocationFunction =
    ::std::option::Option<unsafe extern "C" fn(pUserData:
                                                   *mut ::std::os::raw::c_void,
                                               size: usize, alignment: usize,
                                               allocationScope:
                                                   VkSystemAllocationScope)
                              -> *mut ::std::os::raw::c_void>;
pub type PFN_vkReallocationFunction =
    ::std::option::Option<unsafe extern "C" fn(pUserData:
                                                   *mut ::std::os::raw::c_void,
                                               pOriginal:
                                                   *mut ::std::os::raw::c_void,
                                               size: usize, alignment: usize,
                                               allocationScope:
                                                   VkSystemAllocationScope)
                              -> *mut ::std::os::raw::c_void>;
pub type PFN_vkFreeFunction =
    ::std::option::Option<unsafe extern "C" fn(pUserData:
                                                   *mut ::std::os::raw::c_void,
                                               pMemory:
                                                   *mut ::std::os::raw::c_void)>;
pub type PFN_vkInternalAllocationNotification =
    ::std::option::Option<unsafe extern "C" fn(pUserData:
                                                   *mut ::std::os::raw::c_void,
                                               size: usize,
                                               allocationType:
                                                   VkInternalAllocationType,
                                               allocationScope:
                                                   VkSystemAllocationScope)>;
pub type PFN_vkInternalFreeNotification =
    ::std::option::Option<unsafe extern "C" fn(pUserData:
                                                   *mut ::std::os::raw::c_void,
                                               size: usize,
                                               allocationType:
                                                   VkInternalAllocationType,
                                               allocationScope:
                                                   VkSystemAllocationScope)>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkAllocationCallbacks {
    pub pUserData: *mut ::std::os::raw::c_void,
    pub pfnAllocation: PFN_vkAllocationFunction,
    pub pfnReallocation: PFN_vkReallocationFunction,
    pub pfnFree: PFN_vkFreeFunction,
    pub pfnInternalAllocation: PFN_vkInternalAllocationNotification,
    pub pfnInternalFree: PFN_vkInternalFreeNotification,
}
#[test]
fn bindgen_test_layout_VkAllocationCallbacks() {
    assert_eq!(::std::mem::size_of::<VkAllocationCallbacks>() , 48usize ,
               concat ! ( "Size of: " , stringify ! ( VkAllocationCallbacks )
               ));
    assert_eq! (::std::mem::align_of::<VkAllocationCallbacks>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkAllocationCallbacks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkAllocationCallbacks ) ) . pUserData as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkAllocationCallbacks )
                , "::" , stringify ! ( pUserData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkAllocationCallbacks ) ) . pfnAllocation
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkAllocationCallbacks )
                , "::" , stringify ! ( pfnAllocation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkAllocationCallbacks ) ) .
                pfnReallocation as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkAllocationCallbacks )
                , "::" , stringify ! ( pfnReallocation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkAllocationCallbacks ) ) . pfnFree as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkAllocationCallbacks )
                , "::" , stringify ! ( pfnFree ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkAllocationCallbacks ) ) .
                pfnInternalAllocation as * const _ as usize } , 32usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkAllocationCallbacks )
                , "::" , stringify ! ( pfnInternalAllocation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkAllocationCallbacks ) ) .
                pfnInternalFree as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkAllocationCallbacks )
                , "::" , stringify ! ( pfnInternalFree ) ));
}
impl Clone for VkAllocationCallbacks {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPhysicalDeviceFeatures {
    pub robustBufferAccess: VkBool32,
    pub fullDrawIndexUint32: VkBool32,
    pub imageCubeArray: VkBool32,
    pub independentBlend: VkBool32,
    pub geometryShader: VkBool32,
    pub tessellationShader: VkBool32,
    pub sampleRateShading: VkBool32,
    pub dualSrcBlend: VkBool32,
    pub logicOp: VkBool32,
    pub multiDrawIndirect: VkBool32,
    pub drawIndirectFirstInstance: VkBool32,
    pub depthClamp: VkBool32,
    pub depthBiasClamp: VkBool32,
    pub fillModeNonSolid: VkBool32,
    pub depthBounds: VkBool32,
    pub wideLines: VkBool32,
    pub largePoints: VkBool32,
    pub alphaToOne: VkBool32,
    pub multiViewport: VkBool32,
    pub samplerAnisotropy: VkBool32,
    pub textureCompressionETC2: VkBool32,
    pub textureCompressionASTC_LDR: VkBool32,
    pub textureCompressionBC: VkBool32,
    pub occlusionQueryPrecise: VkBool32,
    pub pipelineStatisticsQuery: VkBool32,
    pub vertexPipelineStoresAndAtomics: VkBool32,
    pub fragmentStoresAndAtomics: VkBool32,
    pub shaderTessellationAndGeometryPointSize: VkBool32,
    pub shaderImageGatherExtended: VkBool32,
    pub shaderStorageImageExtendedFormats: VkBool32,
    pub shaderStorageImageMultisample: VkBool32,
    pub shaderStorageImageReadWithoutFormat: VkBool32,
    pub shaderStorageImageWriteWithoutFormat: VkBool32,
    pub shaderUniformBufferArrayDynamicIndexing: VkBool32,
    pub shaderSampledImageArrayDynamicIndexing: VkBool32,
    pub shaderStorageBufferArrayDynamicIndexing: VkBool32,
    pub shaderStorageImageArrayDynamicIndexing: VkBool32,
    pub shaderClipDistance: VkBool32,
    pub shaderCullDistance: VkBool32,
    pub shaderFloat64: VkBool32,
    pub shaderInt64: VkBool32,
    pub shaderInt16: VkBool32,
    pub shaderResourceResidency: VkBool32,
    pub shaderResourceMinLod: VkBool32,
    pub sparseBinding: VkBool32,
    pub sparseResidencyBuffer: VkBool32,
    pub sparseResidencyImage2D: VkBool32,
    pub sparseResidencyImage3D: VkBool32,
    pub sparseResidency2Samples: VkBool32,
    pub sparseResidency4Samples: VkBool32,
    pub sparseResidency8Samples: VkBool32,
    pub sparseResidency16Samples: VkBool32,
    pub sparseResidencyAliased: VkBool32,
    pub variableMultisampleRate: VkBool32,
    pub inheritedQueries: VkBool32,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceFeatures() {
    assert_eq!(::std::mem::size_of::<VkPhysicalDeviceFeatures>() , 220usize ,
               concat ! (
               "Size of: " , stringify ! ( VkPhysicalDeviceFeatures ) ));
    assert_eq! (::std::mem::align_of::<VkPhysicalDeviceFeatures>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkPhysicalDeviceFeatures ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                robustBufferAccess as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                robustBufferAccess ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                fullDrawIndexUint32 as * const _ as usize } , 4usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                fullDrawIndexUint32 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                imageCubeArray as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                imageCubeArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                independentBlend as * const _ as usize } , 12usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                independentBlend ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                geometryShader as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                geometryShader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                tessellationShader as * const _ as usize } , 20usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                tessellationShader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sampleRateShading as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sampleRateShading ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                dualSrcBlend as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( dualSrcBlend
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) . logicOp as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( logicOp )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                multiDrawIndirect as * const _ as usize } , 36usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                multiDrawIndirect ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                drawIndirectFirstInstance as * const _ as usize } , 40usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                drawIndirectFirstInstance ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) . depthClamp
                as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( depthClamp )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                depthBiasClamp as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                depthBiasClamp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                fillModeNonSolid as * const _ as usize } , 52usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                fillModeNonSolid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                depthBounds as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( depthBounds
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) . wideLines
                as * const _ as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( wideLines )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                largePoints as * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( largePoints
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) . alphaToOne
                as * const _ as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( alphaToOne )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                multiViewport as * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                multiViewport ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                samplerAnisotropy as * const _ as usize } , 76usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                samplerAnisotropy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                textureCompressionETC2 as * const _ as usize } , 80usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                textureCompressionETC2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                textureCompressionASTC_LDR as * const _ as usize } , 84usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                textureCompressionASTC_LDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                textureCompressionBC as * const _ as usize } , 88usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                textureCompressionBC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                occlusionQueryPrecise as * const _ as usize } , 92usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                occlusionQueryPrecise ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                pipelineStatisticsQuery as * const _ as usize } , 96usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                pipelineStatisticsQuery ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                vertexPipelineStoresAndAtomics as * const _ as usize } ,
                100usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                vertexPipelineStoresAndAtomics ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                fragmentStoresAndAtomics as * const _ as usize } , 104usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                fragmentStoresAndAtomics ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderTessellationAndGeometryPointSize as * const _ as usize }
                , 108usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderTessellationAndGeometryPointSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderImageGatherExtended as * const _ as usize } , 112usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderImageGatherExtended ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderStorageImageExtendedFormats as * const _ as usize } ,
                116usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderStorageImageExtendedFormats ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderStorageImageMultisample as * const _ as usize } ,
                120usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderStorageImageMultisample ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderStorageImageReadWithoutFormat as * const _ as usize } ,
                124usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderStorageImageReadWithoutFormat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderStorageImageWriteWithoutFormat as * const _ as usize } ,
                128usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderStorageImageWriteWithoutFormat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderUniformBufferArrayDynamicIndexing as * const _ as usize
                } , 132usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderUniformBufferArrayDynamicIndexing ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderSampledImageArrayDynamicIndexing as * const _ as usize }
                , 136usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderSampledImageArrayDynamicIndexing ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderStorageBufferArrayDynamicIndexing as * const _ as usize
                } , 140usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderStorageBufferArrayDynamicIndexing ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderStorageImageArrayDynamicIndexing as * const _ as usize }
                , 144usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderStorageImageArrayDynamicIndexing ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderClipDistance as * const _ as usize } , 148usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderClipDistance ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderCullDistance as * const _ as usize } , 152usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderCullDistance ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderFloat64 as * const _ as usize } , 156usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderFloat64 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderInt64 as * const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( shaderInt64
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderInt16 as * const _ as usize } , 164usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! ( shaderInt16
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderResourceResidency as * const _ as usize } , 168usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderResourceResidency ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                shaderResourceMinLod as * const _ as usize } , 172usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                shaderResourceMinLod ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseBinding as * const _ as usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseBinding ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidencyBuffer as * const _ as usize } , 180usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidencyBuffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidencyImage2D as * const _ as usize } , 184usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidencyImage2D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidencyImage3D as * const _ as usize } , 188usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidencyImage3D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidency2Samples as * const _ as usize } , 192usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidency2Samples ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidency4Samples as * const _ as usize } , 196usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidency4Samples ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidency8Samples as * const _ as usize } , 200usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidency8Samples ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidency16Samples as * const _ as usize } , 204usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidency16Samples ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                sparseResidencyAliased as * const _ as usize } , 208usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                sparseResidencyAliased ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                variableMultisampleRate as * const _ as usize } , 212usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                variableMultisampleRate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceFeatures ) ) .
                inheritedQueries as * const _ as usize } , 216usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceFeatures ) , "::" , stringify ! (
                inheritedQueries ) ));
}
impl Clone for VkPhysicalDeviceFeatures {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkFormatProperties {
    pub linearTilingFeatures: VkFormatFeatureFlags,
    pub optimalTilingFeatures: VkFormatFeatureFlags,
    pub bufferFeatures: VkFormatFeatureFlags,
}
#[test]
fn bindgen_test_layout_VkFormatProperties() {
    assert_eq!(::std::mem::size_of::<VkFormatProperties>() , 12usize , concat
               ! ( "Size of: " , stringify ! ( VkFormatProperties ) ));
    assert_eq! (::std::mem::align_of::<VkFormatProperties>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( VkFormatProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkFormatProperties ) ) .
                linearTilingFeatures as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkFormatProperties ) ,
                "::" , stringify ! ( linearTilingFeatures ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkFormatProperties ) ) .
                optimalTilingFeatures as * const _ as usize } , 4usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkFormatProperties ) ,
                "::" , stringify ! ( optimalTilingFeatures ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkFormatProperties ) ) . bufferFeatures
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkFormatProperties ) ,
                "::" , stringify ! ( bufferFeatures ) ));
}
impl Clone for VkFormatProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkExtent3D {
    pub width: u32,
    pub height: u32,
    pub depth: u32,
}
#[test]
fn bindgen_test_layout_VkExtent3D() {
    assert_eq!(::std::mem::size_of::<VkExtent3D>() , 12usize , concat ! (
               "Size of: " , stringify ! ( VkExtent3D ) ));
    assert_eq! (::std::mem::align_of::<VkExtent3D>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkExtent3D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtent3D ) ) . width as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtent3D ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtent3D ) ) . height as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtent3D ) , "::" ,
                stringify ! ( height ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtent3D ) ) . depth as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtent3D ) , "::" ,
                stringify ! ( depth ) ));
}
impl Clone for VkExtent3D {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkImageFormatProperties {
    pub maxExtent: VkExtent3D,
    pub maxMipLevels: u32,
    pub maxArrayLayers: u32,
    pub sampleCounts: VkSampleCountFlags,
    pub maxResourceSize: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkImageFormatProperties() {
    assert_eq!(::std::mem::size_of::<VkImageFormatProperties>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( VkImageFormatProperties ) ));
    assert_eq! (::std::mem::align_of::<VkImageFormatProperties>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkImageFormatProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageFormatProperties ) ) . maxExtent
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageFormatProperties
                ) , "::" , stringify ! ( maxExtent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageFormatProperties ) ) .
                maxMipLevels as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageFormatProperties
                ) , "::" , stringify ! ( maxMipLevels ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageFormatProperties ) ) .
                maxArrayLayers as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageFormatProperties
                ) , "::" , stringify ! ( maxArrayLayers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageFormatProperties ) ) .
                sampleCounts as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageFormatProperties
                ) , "::" , stringify ! ( sampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageFormatProperties ) ) .
                maxResourceSize as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageFormatProperties
                ) , "::" , stringify ! ( maxResourceSize ) ));
}
impl Clone for VkImageFormatProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPhysicalDeviceLimits {
    pub maxImageDimension1D: u32,
    pub maxImageDimension2D: u32,
    pub maxImageDimension3D: u32,
    pub maxImageDimensionCube: u32,
    pub maxImageArrayLayers: u32,
    pub maxTexelBufferElements: u32,
    pub maxUniformBufferRange: u32,
    pub maxStorageBufferRange: u32,
    pub maxPushConstantsSize: u32,
    pub maxMemoryAllocationCount: u32,
    pub maxSamplerAllocationCount: u32,
    pub bufferImageGranularity: VkDeviceSize,
    pub sparseAddressSpaceSize: VkDeviceSize,
    pub maxBoundDescriptorSets: u32,
    pub maxPerStageDescriptorSamplers: u32,
    pub maxPerStageDescriptorUniformBuffers: u32,
    pub maxPerStageDescriptorStorageBuffers: u32,
    pub maxPerStageDescriptorSampledImages: u32,
    pub maxPerStageDescriptorStorageImages: u32,
    pub maxPerStageDescriptorInputAttachments: u32,
    pub maxPerStageResources: u32,
    pub maxDescriptorSetSamplers: u32,
    pub maxDescriptorSetUniformBuffers: u32,
    pub maxDescriptorSetUniformBuffersDynamic: u32,
    pub maxDescriptorSetStorageBuffers: u32,
    pub maxDescriptorSetStorageBuffersDynamic: u32,
    pub maxDescriptorSetSampledImages: u32,
    pub maxDescriptorSetStorageImages: u32,
    pub maxDescriptorSetInputAttachments: u32,
    pub maxVertexInputAttributes: u32,
    pub maxVertexInputBindings: u32,
    pub maxVertexInputAttributeOffset: u32,
    pub maxVertexInputBindingStride: u32,
    pub maxVertexOutputComponents: u32,
    pub maxTessellationGenerationLevel: u32,
    pub maxTessellationPatchSize: u32,
    pub maxTessellationControlPerVertexInputComponents: u32,
    pub maxTessellationControlPerVertexOutputComponents: u32,
    pub maxTessellationControlPerPatchOutputComponents: u32,
    pub maxTessellationControlTotalOutputComponents: u32,
    pub maxTessellationEvaluationInputComponents: u32,
    pub maxTessellationEvaluationOutputComponents: u32,
    pub maxGeometryShaderInvocations: u32,
    pub maxGeometryInputComponents: u32,
    pub maxGeometryOutputComponents: u32,
    pub maxGeometryOutputVertices: u32,
    pub maxGeometryTotalOutputComponents: u32,
    pub maxFragmentInputComponents: u32,
    pub maxFragmentOutputAttachments: u32,
    pub maxFragmentDualSrcAttachments: u32,
    pub maxFragmentCombinedOutputResources: u32,
    pub maxComputeSharedMemorySize: u32,
    pub maxComputeWorkGroupCount: [u32; 3usize],
    pub maxComputeWorkGroupInvocations: u32,
    pub maxComputeWorkGroupSize: [u32; 3usize],
    pub subPixelPrecisionBits: u32,
    pub subTexelPrecisionBits: u32,
    pub mipmapPrecisionBits: u32,
    pub maxDrawIndexedIndexValue: u32,
    pub maxDrawIndirectCount: u32,
    pub maxSamplerLodBias: f32,
    pub maxSamplerAnisotropy: f32,
    pub maxViewports: u32,
    pub maxViewportDimensions: [u32; 2usize],
    pub viewportBoundsRange: [f32; 2usize],
    pub viewportSubPixelBits: u32,
    pub minMemoryMapAlignment: usize,
    pub minTexelBufferOffsetAlignment: VkDeviceSize,
    pub minUniformBufferOffsetAlignment: VkDeviceSize,
    pub minStorageBufferOffsetAlignment: VkDeviceSize,
    pub minTexelOffset: i32,
    pub maxTexelOffset: u32,
    pub minTexelGatherOffset: i32,
    pub maxTexelGatherOffset: u32,
    pub minInterpolationOffset: f32,
    pub maxInterpolationOffset: f32,
    pub subPixelInterpolationOffsetBits: u32,
    pub maxFramebufferWidth: u32,
    pub maxFramebufferHeight: u32,
    pub maxFramebufferLayers: u32,
    pub framebufferColorSampleCounts: VkSampleCountFlags,
    pub framebufferDepthSampleCounts: VkSampleCountFlags,
    pub framebufferStencilSampleCounts: VkSampleCountFlags,
    pub framebufferNoAttachmentsSampleCounts: VkSampleCountFlags,
    pub maxColorAttachments: u32,
    pub sampledImageColorSampleCounts: VkSampleCountFlags,
    pub sampledImageIntegerSampleCounts: VkSampleCountFlags,
    pub sampledImageDepthSampleCounts: VkSampleCountFlags,
    pub sampledImageStencilSampleCounts: VkSampleCountFlags,
    pub storageImageSampleCounts: VkSampleCountFlags,
    pub maxSampleMaskWords: u32,
    pub timestampComputeAndGraphics: VkBool32,
    pub timestampPeriod: f32,
    pub maxClipDistances: u32,
    pub maxCullDistances: u32,
    pub maxCombinedClipAndCullDistances: u32,
    pub discreteQueuePriorities: u32,
    pub pointSizeRange: [f32; 2usize],
    pub lineWidthRange: [f32; 2usize],
    pub pointSizeGranularity: f32,
    pub lineWidthGranularity: f32,
    pub strictLines: VkBool32,
    pub standardSampleLocations: VkBool32,
    pub optimalBufferCopyOffsetAlignment: VkDeviceSize,
    pub optimalBufferCopyRowPitchAlignment: VkDeviceSize,
    pub nonCoherentAtomSize: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceLimits() {
    assert_eq!(::std::mem::size_of::<VkPhysicalDeviceLimits>() , 504usize ,
               concat ! ( "Size of: " , stringify ! ( VkPhysicalDeviceLimits )
               ));
    assert_eq! (::std::mem::align_of::<VkPhysicalDeviceLimits>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkPhysicalDeviceLimits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxImageDimension1D as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxImageDimension1D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxImageDimension2D as * const _ as usize } , 4usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxImageDimension2D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxImageDimension3D as * const _ as usize } , 8usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxImageDimension3D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxImageDimensionCube as * const _ as usize } , 12usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxImageDimensionCube ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxImageArrayLayers as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxImageArrayLayers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTexelBufferElements as * const _ as usize } , 20usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxTexelBufferElements ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxUniformBufferRange as * const _ as usize } , 24usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxUniformBufferRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxStorageBufferRange as * const _ as usize } , 28usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxStorageBufferRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPushConstantsSize as * const _ as usize } , 32usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPushConstantsSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxMemoryAllocationCount as * const _ as usize } , 36usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxMemoryAllocationCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxSamplerAllocationCount as * const _ as usize } , 40usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxSamplerAllocationCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                bufferImageGranularity as * const _ as usize } , 48usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( bufferImageGranularity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                sparseAddressSpaceSize as * const _ as usize } , 56usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( sparseAddressSpaceSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxBoundDescriptorSets as * const _ as usize } , 64usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxBoundDescriptorSets ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageDescriptorSamplers as * const _ as usize } ,
                68usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageDescriptorSamplers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageDescriptorUniformBuffers as * const _ as usize } ,
                72usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageDescriptorUniformBuffers )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageDescriptorStorageBuffers as * const _ as usize } ,
                76usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageDescriptorStorageBuffers )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageDescriptorSampledImages as * const _ as usize } ,
                80usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageDescriptorSampledImages )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageDescriptorStorageImages as * const _ as usize } ,
                84usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageDescriptorStorageImages )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageDescriptorInputAttachments as * const _ as usize }
                , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageDescriptorInputAttachments
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxPerStageResources as * const _ as usize } , 92usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxPerStageResources ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetSamplers as * const _ as usize } , 96usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetSamplers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetUniformBuffers as * const _ as usize } ,
                100usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetUniformBuffers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetUniformBuffersDynamic as * const _ as usize }
                , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetUniformBuffersDynamic
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetStorageBuffers as * const _ as usize } ,
                108usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetStorageBuffers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetStorageBuffersDynamic as * const _ as usize }
                , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetStorageBuffersDynamic
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetSampledImages as * const _ as usize } ,
                116usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetSampledImages ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetStorageImages as * const _ as usize } ,
                120usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetStorageImages ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDescriptorSetInputAttachments as * const _ as usize } ,
                124usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDescriptorSetInputAttachments )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxVertexInputAttributes as * const _ as usize } , 128usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxVertexInputAttributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxVertexInputBindings as * const _ as usize } , 132usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxVertexInputBindings ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxVertexInputAttributeOffset as * const _ as usize } ,
                136usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxVertexInputAttributeOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxVertexInputBindingStride as * const _ as usize } , 140usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxVertexInputBindingStride ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxVertexOutputComponents as * const _ as usize } , 144usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxVertexOutputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationGenerationLevel as * const _ as usize } ,
                148usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxTessellationGenerationLevel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationPatchSize as * const _ as usize } , 152usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxTessellationPatchSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationControlPerVertexInputComponents as * const _ as
                usize } , 156usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! (
                maxTessellationControlPerVertexInputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationControlPerVertexOutputComponents as * const _
                as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! (
                maxTessellationControlPerVertexOutputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationControlPerPatchOutputComponents as * const _ as
                usize } , 164usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! (
                maxTessellationControlPerPatchOutputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationControlTotalOutputComponents as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! (
                maxTessellationControlTotalOutputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationEvaluationInputComponents as * const _ as usize
                } , 172usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! (
                maxTessellationEvaluationInputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTessellationEvaluationOutputComponents as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! (
                maxTessellationEvaluationOutputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxGeometryShaderInvocations as * const _ as usize } ,
                180usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxGeometryShaderInvocations ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxGeometryInputComponents as * const _ as usize } , 184usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxGeometryInputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxGeometryOutputComponents as * const _ as usize } , 188usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxGeometryOutputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxGeometryOutputVertices as * const _ as usize } , 192usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxGeometryOutputVertices ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxGeometryTotalOutputComponents as * const _ as usize } ,
                196usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxGeometryTotalOutputComponents )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFragmentInputComponents as * const _ as usize } , 200usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFragmentInputComponents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFragmentOutputAttachments as * const _ as usize } ,
                204usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFragmentOutputAttachments ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFragmentDualSrcAttachments as * const _ as usize } ,
                208usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFragmentDualSrcAttachments ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFragmentCombinedOutputResources as * const _ as usize } ,
                212usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFragmentCombinedOutputResources )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxComputeSharedMemorySize as * const _ as usize } , 216usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxComputeSharedMemorySize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxComputeWorkGroupCount as * const _ as usize } , 220usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxComputeWorkGroupCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxComputeWorkGroupInvocations as * const _ as usize } ,
                232usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxComputeWorkGroupInvocations ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxComputeWorkGroupSize as * const _ as usize } , 236usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxComputeWorkGroupSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                subPixelPrecisionBits as * const _ as usize } , 248usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( subPixelPrecisionBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                subTexelPrecisionBits as * const _ as usize } , 252usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( subTexelPrecisionBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                mipmapPrecisionBits as * const _ as usize } , 256usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( mipmapPrecisionBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDrawIndexedIndexValue as * const _ as usize } , 260usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDrawIndexedIndexValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxDrawIndirectCount as * const _ as usize } , 264usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxDrawIndirectCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxSamplerLodBias as * const _ as usize } , 268usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxSamplerLodBias ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxSamplerAnisotropy as * const _ as usize } , 272usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxSamplerAnisotropy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) . maxViewports
                as * const _ as usize } , 276usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxViewports ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxViewportDimensions as * const _ as usize } , 280usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxViewportDimensions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                viewportBoundsRange as * const _ as usize } , 288usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( viewportBoundsRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                viewportSubPixelBits as * const _ as usize } , 296usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( viewportSubPixelBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minMemoryMapAlignment as * const _ as usize } , 304usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minMemoryMapAlignment ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minTexelBufferOffsetAlignment as * const _ as usize } ,
                312usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minTexelBufferOffsetAlignment ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minUniformBufferOffsetAlignment as * const _ as usize } ,
                320usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minUniformBufferOffsetAlignment ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minStorageBufferOffsetAlignment as * const _ as usize } ,
                328usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minStorageBufferOffsetAlignment ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minTexelOffset as * const _ as usize } , 336usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minTexelOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTexelOffset as * const _ as usize } , 340usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxTexelOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minTexelGatherOffset as * const _ as usize } , 344usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minTexelGatherOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxTexelGatherOffset as * const _ as usize } , 348usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxTexelGatherOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                minInterpolationOffset as * const _ as usize } , 352usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( minInterpolationOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxInterpolationOffset as * const _ as usize } , 356usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxInterpolationOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                subPixelInterpolationOffsetBits as * const _ as usize } ,
                360usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( subPixelInterpolationOffsetBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFramebufferWidth as * const _ as usize } , 364usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFramebufferWidth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFramebufferHeight as * const _ as usize } , 368usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFramebufferHeight ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxFramebufferLayers as * const _ as usize } , 372usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxFramebufferLayers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                framebufferColorSampleCounts as * const _ as usize } ,
                376usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( framebufferColorSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                framebufferDepthSampleCounts as * const _ as usize } ,
                380usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( framebufferDepthSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                framebufferStencilSampleCounts as * const _ as usize } ,
                384usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( framebufferStencilSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                framebufferNoAttachmentsSampleCounts as * const _ as usize } ,
                388usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( framebufferNoAttachmentsSampleCounts
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxColorAttachments as * const _ as usize } , 392usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxColorAttachments ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                sampledImageColorSampleCounts as * const _ as usize } ,
                396usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( sampledImageColorSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                sampledImageIntegerSampleCounts as * const _ as usize } ,
                400usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( sampledImageIntegerSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                sampledImageDepthSampleCounts as * const _ as usize } ,
                404usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( sampledImageDepthSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                sampledImageStencilSampleCounts as * const _ as usize } ,
                408usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( sampledImageStencilSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                storageImageSampleCounts as * const _ as usize } , 412usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( storageImageSampleCounts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxSampleMaskWords as * const _ as usize } , 416usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxSampleMaskWords ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                timestampComputeAndGraphics as * const _ as usize } , 420usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( timestampComputeAndGraphics ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                timestampPeriod as * const _ as usize } , 424usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( timestampPeriod ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxClipDistances as * const _ as usize } , 428usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxClipDistances ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxCullDistances as * const _ as usize } , 432usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxCullDistances ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                maxCombinedClipAndCullDistances as * const _ as usize } ,
                436usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( maxCombinedClipAndCullDistances ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                discreteQueuePriorities as * const _ as usize } , 440usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( discreteQueuePriorities ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                pointSizeRange as * const _ as usize } , 444usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( pointSizeRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                lineWidthRange as * const _ as usize } , 452usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( lineWidthRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                pointSizeGranularity as * const _ as usize } , 460usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( pointSizeGranularity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                lineWidthGranularity as * const _ as usize } , 464usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( lineWidthGranularity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) . strictLines
                as * const _ as usize } , 468usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( strictLines ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                standardSampleLocations as * const _ as usize } , 472usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( standardSampleLocations ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                optimalBufferCopyOffsetAlignment as * const _ as usize } ,
                480usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( optimalBufferCopyOffsetAlignment )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                optimalBufferCopyRowPitchAlignment as * const _ as usize } ,
                488usize , concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( optimalBufferCopyRowPitchAlignment )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceLimits ) ) .
                nonCoherentAtomSize as * const _ as usize } , 496usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkPhysicalDeviceLimits
                ) , "::" , stringify ! ( nonCoherentAtomSize ) ));
}
impl Clone for VkPhysicalDeviceLimits {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPhysicalDeviceSparseProperties {
    pub residencyStandard2DBlockShape: VkBool32,
    pub residencyStandard2DMultisampleBlockShape: VkBool32,
    pub residencyStandard3DBlockShape: VkBool32,
    pub residencyAlignedMipSize: VkBool32,
    pub residencyNonResidentStrict: VkBool32,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceSparseProperties() {
    assert_eq!(::std::mem::size_of::<VkPhysicalDeviceSparseProperties>() ,
               20usize , concat ! (
               "Size of: " , stringify ! ( VkPhysicalDeviceSparseProperties )
               ));
    assert_eq! (::std::mem::align_of::<VkPhysicalDeviceSparseProperties>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                VkPhysicalDeviceSparseProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceSparseProperties ) ) .
                residencyStandard2DBlockShape as * const _ as usize } , 0usize
                , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceSparseProperties ) , "::" , stringify ! (
                residencyStandard2DBlockShape ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceSparseProperties ) ) .
                residencyStandard2DMultisampleBlockShape as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceSparseProperties ) , "::" , stringify ! (
                residencyStandard2DMultisampleBlockShape ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceSparseProperties ) ) .
                residencyStandard3DBlockShape as * const _ as usize } , 8usize
                , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceSparseProperties ) , "::" , stringify ! (
                residencyStandard3DBlockShape ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceSparseProperties ) ) .
                residencyAlignedMipSize as * const _ as usize } , 12usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceSparseProperties ) , "::" , stringify ! (
                residencyAlignedMipSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceSparseProperties ) ) .
                residencyNonResidentStrict as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceSparseProperties ) , "::" , stringify ! (
                residencyNonResidentStrict ) ));
}
impl Clone for VkPhysicalDeviceSparseProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct VkPhysicalDeviceProperties {
    pub apiVersion: u32,
    pub driverVersion: u32,
    pub vendorID: u32,
    pub deviceID: u32,
    pub deviceType: VkPhysicalDeviceType,
    pub deviceName: [::std::os::raw::c_char; 256usize],
    pub pipelineCacheUUID: [u8; 16usize],
    pub limits: VkPhysicalDeviceLimits,
    pub sparseProperties: VkPhysicalDeviceSparseProperties,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceProperties() {
    assert_eq!(::std::mem::size_of::<VkPhysicalDeviceProperties>() , 824usize
               , concat ! (
               "Size of: " , stringify ! ( VkPhysicalDeviceProperties ) ));
    assert_eq! (::std::mem::align_of::<VkPhysicalDeviceProperties>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( VkPhysicalDeviceProperties )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) .
                apiVersion as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! ( apiVersion
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) .
                driverVersion as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! (
                driverVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) . vendorID
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! ( vendorID )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) . deviceID
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! ( deviceID )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) .
                deviceType as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! ( deviceType
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) .
                deviceName as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! ( deviceName
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) .
                pipelineCacheUUID as * const _ as usize } , 276usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! (
                pipelineCacheUUID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) . limits
                as * const _ as usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! ( limits )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceProperties ) ) .
                sparseProperties as * const _ as usize } , 800usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceProperties ) , "::" , stringify ! (
                sparseProperties ) ));
}
impl Clone for VkPhysicalDeviceProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkQueueFamilyProperties {
    pub queueFlags: VkQueueFlags,
    pub queueCount: u32,
    pub timestampValidBits: u32,
    pub minImageTransferGranularity: VkExtent3D,
}
#[test]
fn bindgen_test_layout_VkQueueFamilyProperties() {
    assert_eq!(::std::mem::size_of::<VkQueueFamilyProperties>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( VkQueueFamilyProperties ) ));
    assert_eq! (::std::mem::align_of::<VkQueueFamilyProperties>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkQueueFamilyProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueueFamilyProperties ) ) . queueFlags
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueueFamilyProperties
                ) , "::" , stringify ! ( queueFlags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueueFamilyProperties ) ) . queueCount
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueueFamilyProperties
                ) , "::" , stringify ! ( queueCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueueFamilyProperties ) ) .
                timestampValidBits as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkQueueFamilyProperties
                ) , "::" , stringify ! ( timestampValidBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueueFamilyProperties ) ) .
                minImageTransferGranularity as * const _ as usize } , 12usize
                , concat ! (
                "Alignment of field: " , stringify ! ( VkQueueFamilyProperties
                ) , "::" , stringify ! ( minImageTransferGranularity ) ));
}
impl Clone for VkQueueFamilyProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkMemoryType {
    pub propertyFlags: VkMemoryPropertyFlags,
    pub heapIndex: u32,
}
#[test]
fn bindgen_test_layout_VkMemoryType() {
    assert_eq!(::std::mem::size_of::<VkMemoryType>() , 8usize , concat ! (
               "Size of: " , stringify ! ( VkMemoryType ) ));
    assert_eq! (::std::mem::align_of::<VkMemoryType>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkMemoryType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryType ) ) . propertyFlags as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryType ) , "::" ,
                stringify ! ( propertyFlags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryType ) ) . heapIndex as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryType ) , "::" ,
                stringify ! ( heapIndex ) ));
}
impl Clone for VkMemoryType {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkMemoryHeap {
    pub size: VkDeviceSize,
    pub flags: VkMemoryHeapFlags,
}
#[test]
fn bindgen_test_layout_VkMemoryHeap() {
    assert_eq!(::std::mem::size_of::<VkMemoryHeap>() , 16usize , concat ! (
               "Size of: " , stringify ! ( VkMemoryHeap ) ));
    assert_eq! (::std::mem::align_of::<VkMemoryHeap>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( VkMemoryHeap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryHeap ) ) . size as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryHeap ) , "::" ,
                stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryHeap ) ) . flags as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryHeap ) , "::" ,
                stringify ! ( flags ) ));
}
impl Clone for VkMemoryHeap {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPhysicalDeviceMemoryProperties {
    pub memoryTypeCount: u32,
    pub memoryTypes: [VkMemoryType; 32usize],
    pub memoryHeapCount: u32,
    pub memoryHeaps: [VkMemoryHeap; 16usize],
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceMemoryProperties() {
    assert_eq!(::std::mem::size_of::<VkPhysicalDeviceMemoryProperties>() ,
               520usize , concat ! (
               "Size of: " , stringify ! ( VkPhysicalDeviceMemoryProperties )
               ));
    assert_eq! (::std::mem::align_of::<VkPhysicalDeviceMemoryProperties>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPhysicalDeviceMemoryProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceMemoryProperties ) ) .
                memoryTypeCount as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceMemoryProperties ) , "::" , stringify ! (
                memoryTypeCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceMemoryProperties ) ) .
                memoryTypes as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceMemoryProperties ) , "::" , stringify ! (
                memoryTypes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceMemoryProperties ) ) .
                memoryHeapCount as * const _ as usize } , 260usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceMemoryProperties ) , "::" , stringify ! (
                memoryHeapCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPhysicalDeviceMemoryProperties ) ) .
                memoryHeaps as * const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPhysicalDeviceMemoryProperties ) , "::" , stringify ! (
                memoryHeaps ) ));
}
impl Clone for VkPhysicalDeviceMemoryProperties {
    fn clone(&self) -> Self { *self }
}
pub type PFN_vkVoidFunction = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkDeviceQueueCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkDeviceQueueCreateFlags,
    pub queueFamilyIndex: u32,
    pub queueCount: u32,
    pub pQueuePriorities: *const f32,
}
#[test]
fn bindgen_test_layout_VkDeviceQueueCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkDeviceQueueCreateInfo>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( VkDeviceQueueCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkDeviceQueueCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkDeviceQueueCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceQueueCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceQueueCreateInfo
                ) , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceQueueCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceQueueCreateInfo
                ) , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceQueueCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceQueueCreateInfo
                ) , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceQueueCreateInfo ) ) .
                queueFamilyIndex as * const _ as usize } , 20usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkDeviceQueueCreateInfo
                ) , "::" , stringify ! ( queueFamilyIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceQueueCreateInfo ) ) . queueCount
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceQueueCreateInfo
                ) , "::" , stringify ! ( queueCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceQueueCreateInfo ) ) .
                pQueuePriorities as * const _ as usize } , 32usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkDeviceQueueCreateInfo
                ) , "::" , stringify ! ( pQueuePriorities ) ));
}
impl Clone for VkDeviceQueueCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkDeviceCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkDeviceCreateFlags,
    pub queueCreateInfoCount: u32,
    pub pQueueCreateInfos: *const VkDeviceQueueCreateInfo,
    pub enabledLayerCount: u32,
    pub ppEnabledLayerNames: *const *const ::std::os::raw::c_char,
    pub enabledExtensionCount: u32,
    pub ppEnabledExtensionNames: *const *const ::std::os::raw::c_char,
    pub pEnabledFeatures: *const VkPhysicalDeviceFeatures,
}
#[test]
fn bindgen_test_layout_VkDeviceCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkDeviceCreateInfo>() , 72usize , concat
               ! ( "Size of: " , stringify ! ( VkDeviceCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkDeviceCreateInfo>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkDeviceCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) . sType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) . pNext as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) . flags as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) .
                queueCreateInfoCount as * const _ as usize } , 20usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( queueCreateInfoCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) .
                pQueueCreateInfos as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( pQueueCreateInfos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) .
                enabledLayerCount as * const _ as usize } , 32usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( enabledLayerCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) .
                ppEnabledLayerNames as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( ppEnabledLayerNames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) .
                enabledExtensionCount as * const _ as usize } , 48usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( enabledExtensionCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) .
                ppEnabledExtensionNames as * const _ as usize } , 56usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( ppEnabledExtensionNames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkDeviceCreateInfo ) ) . pEnabledFeatures
                as * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( VkDeviceCreateInfo ) ,
                "::" , stringify ! ( pEnabledFeatures ) ));
}
impl Clone for VkDeviceCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct VkExtensionProperties {
    pub extensionName: [::std::os::raw::c_char; 256usize],
    pub specVersion: u32,
}
#[test]
fn bindgen_test_layout_VkExtensionProperties() {
    assert_eq!(::std::mem::size_of::<VkExtensionProperties>() , 260usize ,
               concat ! ( "Size of: " , stringify ! ( VkExtensionProperties )
               ));
    assert_eq! (::std::mem::align_of::<VkExtensionProperties>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkExtensionProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtensionProperties ) ) . extensionName
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtensionProperties )
                , "::" , stringify ! ( extensionName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtensionProperties ) ) . specVersion
                as * const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtensionProperties )
                , "::" , stringify ! ( specVersion ) ));
}
impl Clone for VkExtensionProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct VkLayerProperties {
    pub layerName: [::std::os::raw::c_char; 256usize],
    pub specVersion: u32,
    pub implementationVersion: u32,
    pub description: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_VkLayerProperties() {
    assert_eq!(::std::mem::size_of::<VkLayerProperties>() , 520usize , concat
               ! ( "Size of: " , stringify ! ( VkLayerProperties ) ));
    assert_eq! (::std::mem::align_of::<VkLayerProperties>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( VkLayerProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkLayerProperties ) ) . layerName as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkLayerProperties ) ,
                "::" , stringify ! ( layerName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkLayerProperties ) ) . specVersion as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( VkLayerProperties ) ,
                "::" , stringify ! ( specVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkLayerProperties ) ) .
                implementationVersion as * const _ as usize } , 260usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkLayerProperties ) ,
                "::" , stringify ! ( implementationVersion ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkLayerProperties ) ) . description as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( VkLayerProperties ) ,
                "::" , stringify ! ( description ) ));
}
impl Clone for VkLayerProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSubmitInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub waitSemaphoreCount: u32,
    pub pWaitSemaphores: *const VkSemaphore,
    pub pWaitDstStageMask: *const VkPipelineStageFlags,
    pub commandBufferCount: u32,
    pub pCommandBuffers: *const VkCommandBuffer,
    pub signalSemaphoreCount: u32,
    pub pSignalSemaphores: *const VkSemaphore,
}
#[test]
fn bindgen_test_layout_VkSubmitInfo() {
    assert_eq!(::std::mem::size_of::<VkSubmitInfo>() , 72usize , concat ! (
               "Size of: " , stringify ! ( VkSubmitInfo ) ));
    assert_eq! (::std::mem::align_of::<VkSubmitInfo>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( VkSubmitInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . sType as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . pNext as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . waitSemaphoreCount as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( waitSemaphoreCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . pWaitSemaphores as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( pWaitSemaphores ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . pWaitDstStageMask as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( pWaitDstStageMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . commandBufferCount as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( commandBufferCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . pCommandBuffers as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( pCommandBuffers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . signalSemaphoreCount
                as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( signalSemaphoreCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubmitInfo ) ) . pSignalSemaphores as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubmitInfo ) , "::" ,
                stringify ! ( pSignalSemaphores ) ));
}
impl Clone for VkSubmitInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkMemoryAllocateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub allocationSize: VkDeviceSize,
    pub memoryTypeIndex: u32,
}
#[test]
fn bindgen_test_layout_VkMemoryAllocateInfo() {
    assert_eq!(::std::mem::size_of::<VkMemoryAllocateInfo>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( VkMemoryAllocateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkMemoryAllocateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkMemoryAllocateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryAllocateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryAllocateInfo )
                , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryAllocateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryAllocateInfo )
                , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryAllocateInfo ) ) . allocationSize
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryAllocateInfo )
                , "::" , stringify ! ( allocationSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryAllocateInfo ) ) .
                memoryTypeIndex as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryAllocateInfo )
                , "::" , stringify ! ( memoryTypeIndex ) ));
}
impl Clone for VkMemoryAllocateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkMappedMemoryRange {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub memory: VkDeviceMemory,
    pub offset: VkDeviceSize,
    pub size: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkMappedMemoryRange() {
    assert_eq!(::std::mem::size_of::<VkMappedMemoryRange>() , 40usize , concat
               ! ( "Size of: " , stringify ! ( VkMappedMemoryRange ) ));
    assert_eq! (::std::mem::align_of::<VkMappedMemoryRange>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkMappedMemoryRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMappedMemoryRange ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMappedMemoryRange ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMappedMemoryRange ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMappedMemoryRange ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMappedMemoryRange ) ) . memory as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMappedMemoryRange ) ,
                "::" , stringify ! ( memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMappedMemoryRange ) ) . offset as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMappedMemoryRange ) ,
                "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMappedMemoryRange ) ) . size as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMappedMemoryRange ) ,
                "::" , stringify ! ( size ) ));
}
impl Clone for VkMappedMemoryRange {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkMemoryRequirements {
    pub size: VkDeviceSize,
    pub alignment: VkDeviceSize,
    pub memoryTypeBits: u32,
}
#[test]
fn bindgen_test_layout_VkMemoryRequirements() {
    assert_eq!(::std::mem::size_of::<VkMemoryRequirements>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( VkMemoryRequirements )
               ));
    assert_eq! (::std::mem::align_of::<VkMemoryRequirements>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkMemoryRequirements ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryRequirements ) ) . size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryRequirements )
                , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryRequirements ) ) . alignment as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryRequirements )
                , "::" , stringify ! ( alignment ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkMemoryRequirements ) ) . memoryTypeBits
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkMemoryRequirements )
                , "::" , stringify ! ( memoryTypeBits ) ));
}
impl Clone for VkMemoryRequirements {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseImageFormatProperties {
    pub aspectMask: VkImageAspectFlags,
    pub imageGranularity: VkExtent3D,
    pub flags: VkSparseImageFormatFlags,
}
#[test]
fn bindgen_test_layout_VkSparseImageFormatProperties() {
    assert_eq!(::std::mem::size_of::<VkSparseImageFormatProperties>() ,
               20usize , concat ! (
               "Size of: " , stringify ! ( VkSparseImageFormatProperties ) ));
    assert_eq! (::std::mem::align_of::<VkSparseImageFormatProperties>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( VkSparseImageFormatProperties
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageFormatProperties ) ) .
                aspectMask as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageFormatProperties ) , "::" , stringify ! (
                aspectMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageFormatProperties ) ) .
                imageGranularity as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageFormatProperties ) , "::" , stringify ! (
                imageGranularity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageFormatProperties ) ) . flags
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageFormatProperties ) , "::" , stringify ! ( flags )
                ));
}
impl Clone for VkSparseImageFormatProperties {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseImageMemoryRequirements {
    pub formatProperties: VkSparseImageFormatProperties,
    pub imageMipTailFirstLod: u32,
    pub imageMipTailSize: VkDeviceSize,
    pub imageMipTailOffset: VkDeviceSize,
    pub imageMipTailStride: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkSparseImageMemoryRequirements() {
    assert_eq!(::std::mem::size_of::<VkSparseImageMemoryRequirements>() ,
               48usize , concat ! (
               "Size of: " , stringify ! ( VkSparseImageMemoryRequirements )
               ));
    assert_eq! (::std::mem::align_of::<VkSparseImageMemoryRequirements>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                VkSparseImageMemoryRequirements ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryRequirements ) ) .
                formatProperties as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryRequirements ) , "::" , stringify ! (
                formatProperties ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryRequirements ) ) .
                imageMipTailFirstLod as * const _ as usize } , 20usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryRequirements ) , "::" , stringify ! (
                imageMipTailFirstLod ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryRequirements ) ) .
                imageMipTailSize as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryRequirements ) , "::" , stringify ! (
                imageMipTailSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryRequirements ) ) .
                imageMipTailOffset as * const _ as usize } , 32usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryRequirements ) , "::" , stringify ! (
                imageMipTailOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryRequirements ) ) .
                imageMipTailStride as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryRequirements ) , "::" , stringify ! (
                imageMipTailStride ) ));
}
impl Clone for VkSparseImageMemoryRequirements {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseMemoryBind {
    pub resourceOffset: VkDeviceSize,
    pub size: VkDeviceSize,
    pub memory: VkDeviceMemory,
    pub memoryOffset: VkDeviceSize,
    pub flags: VkSparseMemoryBindFlags,
}
#[test]
fn bindgen_test_layout_VkSparseMemoryBind() {
    assert_eq!(::std::mem::size_of::<VkSparseMemoryBind>() , 40usize , concat
               ! ( "Size of: " , stringify ! ( VkSparseMemoryBind ) ));
    assert_eq! (::std::mem::align_of::<VkSparseMemoryBind>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkSparseMemoryBind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseMemoryBind ) ) . resourceOffset
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseMemoryBind ) ,
                "::" , stringify ! ( resourceOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseMemoryBind ) ) . size as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseMemoryBind ) ,
                "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseMemoryBind ) ) . memory as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseMemoryBind ) ,
                "::" , stringify ! ( memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseMemoryBind ) ) . memoryOffset as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseMemoryBind ) ,
                "::" , stringify ! ( memoryOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseMemoryBind ) ) . flags as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseMemoryBind ) ,
                "::" , stringify ! ( flags ) ));
}
impl Clone for VkSparseMemoryBind {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseBufferMemoryBindInfo {
    pub buffer: VkBuffer,
    pub bindCount: u32,
    pub pBinds: *const VkSparseMemoryBind,
}
#[test]
fn bindgen_test_layout_VkSparseBufferMemoryBindInfo() {
    assert_eq!(::std::mem::size_of::<VkSparseBufferMemoryBindInfo>() , 24usize
               , concat ! (
               "Size of: " , stringify ! ( VkSparseBufferMemoryBindInfo ) ));
    assert_eq! (::std::mem::align_of::<VkSparseBufferMemoryBindInfo>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( VkSparseBufferMemoryBindInfo )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseBufferMemoryBindInfo ) ) . buffer
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseBufferMemoryBindInfo ) , "::" , stringify ! ( buffer )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseBufferMemoryBindInfo ) ) .
                bindCount as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseBufferMemoryBindInfo ) , "::" , stringify ! (
                bindCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseBufferMemoryBindInfo ) ) . pBinds
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseBufferMemoryBindInfo ) , "::" , stringify ! ( pBinds )
                ));
}
impl Clone for VkSparseBufferMemoryBindInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseImageOpaqueMemoryBindInfo {
    pub image: VkImage,
    pub bindCount: u32,
    pub pBinds: *const VkSparseMemoryBind,
}
#[test]
fn bindgen_test_layout_VkSparseImageOpaqueMemoryBindInfo() {
    assert_eq!(::std::mem::size_of::<VkSparseImageOpaqueMemoryBindInfo>() ,
               24usize , concat ! (
               "Size of: " , stringify ! ( VkSparseImageOpaqueMemoryBindInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkSparseImageOpaqueMemoryBindInfo>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                VkSparseImageOpaqueMemoryBindInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageOpaqueMemoryBindInfo ) ) .
                image as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageOpaqueMemoryBindInfo ) , "::" , stringify ! (
                image ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageOpaqueMemoryBindInfo ) ) .
                bindCount as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageOpaqueMemoryBindInfo ) , "::" , stringify ! (
                bindCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageOpaqueMemoryBindInfo ) ) .
                pBinds as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageOpaqueMemoryBindInfo ) , "::" , stringify ! (
                pBinds ) ));
}
impl Clone for VkSparseImageOpaqueMemoryBindInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkImageSubresource {
    pub aspectMask: VkImageAspectFlags,
    pub mipLevel: u32,
    pub arrayLayer: u32,
}
#[test]
fn bindgen_test_layout_VkImageSubresource() {
    assert_eq!(::std::mem::size_of::<VkImageSubresource>() , 12usize , concat
               ! ( "Size of: " , stringify ! ( VkImageSubresource ) ));
    assert_eq! (::std::mem::align_of::<VkImageSubresource>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( VkImageSubresource ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresource ) ) . aspectMask as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresource ) ,
                "::" , stringify ! ( aspectMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresource ) ) . mipLevel as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresource ) ,
                "::" , stringify ! ( mipLevel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresource ) ) . arrayLayer as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresource ) ,
                "::" , stringify ! ( arrayLayer ) ));
}
impl Clone for VkImageSubresource {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkOffset3D {
    pub x: i32,
    pub y: i32,
    pub z: i32,
}
#[test]
fn bindgen_test_layout_VkOffset3D() {
    assert_eq!(::std::mem::size_of::<VkOffset3D>() , 12usize , concat ! (
               "Size of: " , stringify ! ( VkOffset3D ) ));
    assert_eq! (::std::mem::align_of::<VkOffset3D>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkOffset3D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkOffset3D ) ) . x as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkOffset3D ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkOffset3D ) ) . y as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkOffset3D ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkOffset3D ) ) . z as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkOffset3D ) , "::" ,
                stringify ! ( z ) ));
}
impl Clone for VkOffset3D {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseImageMemoryBind {
    pub subresource: VkImageSubresource,
    pub offset: VkOffset3D,
    pub extent: VkExtent3D,
    pub memory: VkDeviceMemory,
    pub memoryOffset: VkDeviceSize,
    pub flags: VkSparseMemoryBindFlags,
}
#[test]
fn bindgen_test_layout_VkSparseImageMemoryBind() {
    assert_eq!(::std::mem::size_of::<VkSparseImageMemoryBind>() , 64usize ,
               concat ! (
               "Size of: " , stringify ! ( VkSparseImageMemoryBind ) ));
    assert_eq! (::std::mem::align_of::<VkSparseImageMemoryBind>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkSparseImageMemoryBind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBind ) ) . subresource
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseImageMemoryBind
                ) , "::" , stringify ! ( subresource ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBind ) ) . offset as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseImageMemoryBind
                ) , "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBind ) ) . extent as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseImageMemoryBind
                ) , "::" , stringify ! ( extent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBind ) ) . memory as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseImageMemoryBind
                ) , "::" , stringify ! ( memory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBind ) ) .
                memoryOffset as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseImageMemoryBind
                ) , "::" , stringify ! ( memoryOffset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBind ) ) . flags as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSparseImageMemoryBind
                ) , "::" , stringify ! ( flags ) ));
}
impl Clone for VkSparseImageMemoryBind {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSparseImageMemoryBindInfo {
    pub image: VkImage,
    pub bindCount: u32,
    pub pBinds: *const VkSparseImageMemoryBind,
}
#[test]
fn bindgen_test_layout_VkSparseImageMemoryBindInfo() {
    assert_eq!(::std::mem::size_of::<VkSparseImageMemoryBindInfo>() , 24usize
               , concat ! (
               "Size of: " , stringify ! ( VkSparseImageMemoryBindInfo ) ));
    assert_eq! (::std::mem::align_of::<VkSparseImageMemoryBindInfo>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( VkSparseImageMemoryBindInfo )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBindInfo ) ) . image
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryBindInfo ) , "::" , stringify ! ( image )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBindInfo ) ) .
                bindCount as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryBindInfo ) , "::" , stringify ! ( bindCount
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSparseImageMemoryBindInfo ) ) . pBinds
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSparseImageMemoryBindInfo ) , "::" , stringify ! ( pBinds )
                ));
}
impl Clone for VkSparseImageMemoryBindInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkBindSparseInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub waitSemaphoreCount: u32,
    pub pWaitSemaphores: *const VkSemaphore,
    pub bufferBindCount: u32,
    pub pBufferBinds: *const VkSparseBufferMemoryBindInfo,
    pub imageOpaqueBindCount: u32,
    pub pImageOpaqueBinds: *const VkSparseImageOpaqueMemoryBindInfo,
    pub imageBindCount: u32,
    pub pImageBinds: *const VkSparseImageMemoryBindInfo,
    pub signalSemaphoreCount: u32,
    pub pSignalSemaphores: *const VkSemaphore,
}
#[test]
fn bindgen_test_layout_VkBindSparseInfo() {
    assert_eq!(::std::mem::size_of::<VkBindSparseInfo>() , 96usize , concat !
               ( "Size of: " , stringify ! ( VkBindSparseInfo ) ));
    assert_eq! (::std::mem::align_of::<VkBindSparseInfo>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( VkBindSparseInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . sType as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . pNext as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . waitSemaphoreCount
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( waitSemaphoreCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . pWaitSemaphores as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( pWaitSemaphores ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . bufferBindCount as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( bufferBindCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . pBufferBinds as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( pBufferBinds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) .
                imageOpaqueBindCount as * const _ as usize } , 48usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( imageOpaqueBindCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . pImageOpaqueBinds
                as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( pImageOpaqueBinds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . imageBindCount as
                * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( imageBindCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . pImageBinds as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( pImageBinds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) .
                signalSemaphoreCount as * const _ as usize } , 80usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( signalSemaphoreCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBindSparseInfo ) ) . pSignalSemaphores
                as * const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBindSparseInfo ) ,
                "::" , stringify ! ( pSignalSemaphores ) ));
}
impl Clone for VkBindSparseInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkFenceCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkFenceCreateFlags,
}
#[test]
fn bindgen_test_layout_VkFenceCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkFenceCreateInfo>() , 24usize , concat !
               ( "Size of: " , stringify ! ( VkFenceCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkFenceCreateInfo>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkFenceCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkFenceCreateInfo ) ) . sType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkFenceCreateInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkFenceCreateInfo ) ) . pNext as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkFenceCreateInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkFenceCreateInfo ) ) . flags as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkFenceCreateInfo ) ,
                "::" , stringify ! ( flags ) ));
}
impl Clone for VkFenceCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSemaphoreCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkSemaphoreCreateFlags,
}
#[test]
fn bindgen_test_layout_VkSemaphoreCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkSemaphoreCreateInfo>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( VkSemaphoreCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkSemaphoreCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkSemaphoreCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSemaphoreCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSemaphoreCreateInfo )
                , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSemaphoreCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSemaphoreCreateInfo )
                , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSemaphoreCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSemaphoreCreateInfo )
                , "::" , stringify ! ( flags ) ));
}
impl Clone for VkSemaphoreCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkEventCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkEventCreateFlags,
}
#[test]
fn bindgen_test_layout_VkEventCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkEventCreateInfo>() , 24usize , concat !
               ( "Size of: " , stringify ! ( VkEventCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkEventCreateInfo>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkEventCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkEventCreateInfo ) ) . sType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkEventCreateInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkEventCreateInfo ) ) . pNext as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkEventCreateInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkEventCreateInfo ) ) . flags as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkEventCreateInfo ) ,
                "::" , stringify ! ( flags ) ));
}
impl Clone for VkEventCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkQueryPoolCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkQueryPoolCreateFlags,
    pub queryType: VkQueryType,
    pub queryCount: u32,
    pub pipelineStatistics: VkQueryPipelineStatisticFlags,
}
#[test]
fn bindgen_test_layout_VkQueryPoolCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkQueryPoolCreateInfo>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( VkQueryPoolCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkQueryPoolCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkQueryPoolCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueryPoolCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueryPoolCreateInfo )
                , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueryPoolCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueryPoolCreateInfo )
                , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueryPoolCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueryPoolCreateInfo )
                , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueryPoolCreateInfo ) ) . queryType as
                * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueryPoolCreateInfo )
                , "::" , stringify ! ( queryType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueryPoolCreateInfo ) ) . queryCount as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkQueryPoolCreateInfo )
                , "::" , stringify ! ( queryCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkQueryPoolCreateInfo ) ) .
                pipelineStatistics as * const _ as usize } , 28usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkQueryPoolCreateInfo )
                , "::" , stringify ! ( pipelineStatistics ) ));
}
impl Clone for VkQueryPoolCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkBufferCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkBufferCreateFlags,
    pub size: VkDeviceSize,
    pub usage: VkBufferUsageFlags,
    pub sharingMode: VkSharingMode,
    pub queueFamilyIndexCount: u32,
    pub pQueueFamilyIndices: *const u32,
}
#[test]
fn bindgen_test_layout_VkBufferCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkBufferCreateInfo>() , 56usize , concat
               ! ( "Size of: " , stringify ! ( VkBufferCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkBufferCreateInfo>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkBufferCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) . sType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) . pNext as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) . flags as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) . size as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) . usage as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( usage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) . sharingMode as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( sharingMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) .
                queueFamilyIndexCount as * const _ as usize } , 40usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( queueFamilyIndexCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferCreateInfo ) ) .
                pQueueFamilyIndices as * const _ as usize } , 48usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkBufferCreateInfo ) ,
                "::" , stringify ! ( pQueueFamilyIndices ) ));
}
impl Clone for VkBufferCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkBufferViewCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkBufferViewCreateFlags,
    pub buffer: VkBuffer,
    pub format: VkFormat,
    pub offset: VkDeviceSize,
    pub range: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkBufferViewCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkBufferViewCreateInfo>() , 56usize ,
               concat ! ( "Size of: " , stringify ! ( VkBufferViewCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkBufferViewCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkBufferViewCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . buffer as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . format as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( format ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . offset as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkBufferViewCreateInfo ) ) . range as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( VkBufferViewCreateInfo
                ) , "::" , stringify ! ( range ) ));
}
impl Clone for VkBufferViewCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkImageCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkImageCreateFlags,
    pub imageType: VkImageType,
    pub format: VkFormat,
    pub extent: VkExtent3D,
    pub mipLevels: u32,
    pub arrayLayers: u32,
    pub samples: VkSampleCountFlagBits,
    pub tiling: VkImageTiling,
    pub usage: VkImageUsageFlags,
    pub sharingMode: VkSharingMode,
    pub queueFamilyIndexCount: u32,
    pub pQueueFamilyIndices: *const u32,
    pub initialLayout: VkImageLayout,
}
#[test]
fn bindgen_test_layout_VkImageCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkImageCreateInfo>() , 88usize , concat !
               ( "Size of: " , stringify ! ( VkImageCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkImageCreateInfo>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( VkImageCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . sType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . pNext as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . flags as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . imageType as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( imageType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . format as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( format ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . extent as * const
                _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( extent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . mipLevels as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( mipLevels ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . arrayLayers as *
                const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( arrayLayers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . samples as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( samples ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . tiling as * const
                _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( tiling ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . usage as * const
                _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( usage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . sharingMode as *
                const _ as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( sharingMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) .
                queueFamilyIndexCount as * const _ as usize } , 64usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( queueFamilyIndexCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) .
                pQueueFamilyIndices as * const _ as usize } , 72usize , concat
                ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( pQueueFamilyIndices ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageCreateInfo ) ) . initialLayout as
                * const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageCreateInfo ) ,
                "::" , stringify ! ( initialLayout ) ));
}
impl Clone for VkImageCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSubresourceLayout {
    pub offset: VkDeviceSize,
    pub size: VkDeviceSize,
    pub rowPitch: VkDeviceSize,
    pub arrayPitch: VkDeviceSize,
    pub depthPitch: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkSubresourceLayout() {
    assert_eq!(::std::mem::size_of::<VkSubresourceLayout>() , 40usize , concat
               ! ( "Size of: " , stringify ! ( VkSubresourceLayout ) ));
    assert_eq! (::std::mem::align_of::<VkSubresourceLayout>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkSubresourceLayout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubresourceLayout ) ) . offset as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubresourceLayout ) ,
                "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubresourceLayout ) ) . size as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubresourceLayout ) ,
                "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubresourceLayout ) ) . rowPitch as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubresourceLayout ) ,
                "::" , stringify ! ( rowPitch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubresourceLayout ) ) . arrayPitch as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubresourceLayout ) ,
                "::" , stringify ! ( arrayPitch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSubresourceLayout ) ) . depthPitch as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSubresourceLayout ) ,
                "::" , stringify ! ( depthPitch ) ));
}
impl Clone for VkSubresourceLayout {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkComponentMapping {
    pub r: VkComponentSwizzle,
    pub g: VkComponentSwizzle,
    pub b: VkComponentSwizzle,
    pub a: VkComponentSwizzle,
}
#[test]
fn bindgen_test_layout_VkComponentMapping() {
    assert_eq!(::std::mem::size_of::<VkComponentMapping>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( VkComponentMapping ) ));
    assert_eq! (::std::mem::align_of::<VkComponentMapping>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( VkComponentMapping ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkComponentMapping ) ) . r as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkComponentMapping ) ,
                "::" , stringify ! ( r ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkComponentMapping ) ) . g as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkComponentMapping ) ,
                "::" , stringify ! ( g ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkComponentMapping ) ) . b as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkComponentMapping ) ,
                "::" , stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkComponentMapping ) ) . a as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( VkComponentMapping ) ,
                "::" , stringify ! ( a ) ));
}
impl Clone for VkComponentMapping {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkImageSubresourceRange {
    pub aspectMask: VkImageAspectFlags,
    pub baseMipLevel: u32,
    pub levelCount: u32,
    pub baseArrayLayer: u32,
    pub layerCount: u32,
}
#[test]
fn bindgen_test_layout_VkImageSubresourceRange() {
    assert_eq!(::std::mem::size_of::<VkImageSubresourceRange>() , 20usize ,
               concat ! (
               "Size of: " , stringify ! ( VkImageSubresourceRange ) ));
    assert_eq! (::std::mem::align_of::<VkImageSubresourceRange>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkImageSubresourceRange ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresourceRange ) ) . aspectMask
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresourceRange
                ) , "::" , stringify ! ( aspectMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresourceRange ) ) .
                baseMipLevel as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresourceRange
                ) , "::" , stringify ! ( baseMipLevel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresourceRange ) ) . levelCount
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresourceRange
                ) , "::" , stringify ! ( levelCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresourceRange ) ) .
                baseArrayLayer as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresourceRange
                ) , "::" , stringify ! ( baseArrayLayer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageSubresourceRange ) ) . layerCount
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageSubresourceRange
                ) , "::" , stringify ! ( layerCount ) ));
}
impl Clone for VkImageSubresourceRange {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkImageViewCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkImageViewCreateFlags,
    pub image: VkImage,
    pub viewType: VkImageViewType,
    pub format: VkFormat,
    pub components: VkComponentMapping,
    pub subresourceRange: VkImageSubresourceRange,
}
#[test]
fn bindgen_test_layout_VkImageViewCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkImageViewCreateInfo>() , 80usize ,
               concat ! ( "Size of: " , stringify ! ( VkImageViewCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkImageViewCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkImageViewCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . image as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( image ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . viewType as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( viewType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . format as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( format ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) . components as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( components ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkImageViewCreateInfo ) ) .
                subresourceRange as * const _ as usize } , 56usize , concat !
                (
                "Alignment of field: " , stringify ! ( VkImageViewCreateInfo )
                , "::" , stringify ! ( subresourceRange ) ));
}
impl Clone for VkImageViewCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkShaderModuleCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkShaderModuleCreateFlags,
    pub codeSize: usize,
    pub pCode: *const u32,
}
#[test]
fn bindgen_test_layout_VkShaderModuleCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkShaderModuleCreateInfo>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( VkShaderModuleCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkShaderModuleCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkShaderModuleCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkShaderModuleCreateInfo ) ) . sType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkShaderModuleCreateInfo ) , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkShaderModuleCreateInfo ) ) . pNext as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkShaderModuleCreateInfo ) , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkShaderModuleCreateInfo ) ) . flags as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkShaderModuleCreateInfo ) , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkShaderModuleCreateInfo ) ) . codeSize
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkShaderModuleCreateInfo ) , "::" , stringify ! ( codeSize )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkShaderModuleCreateInfo ) ) . pCode as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkShaderModuleCreateInfo ) , "::" , stringify ! ( pCode ) ));
}
impl Clone for VkShaderModuleCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineCacheCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineCacheCreateFlags,
    pub initialDataSize: usize,
    pub pInitialData: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_VkPipelineCacheCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineCacheCreateInfo>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( VkPipelineCacheCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineCacheCreateInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkPipelineCacheCreateInfo )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineCacheCreateInfo ) ) . sType as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineCacheCreateInfo ) , "::" , stringify ! ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineCacheCreateInfo ) ) . pNext as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineCacheCreateInfo ) , "::" , stringify ! ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineCacheCreateInfo ) ) . flags as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineCacheCreateInfo ) , "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineCacheCreateInfo ) ) .
                initialDataSize as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineCacheCreateInfo ) , "::" , stringify ! (
                initialDataSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineCacheCreateInfo ) ) .
                pInitialData as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineCacheCreateInfo ) , "::" , stringify ! (
                pInitialData ) ));
}
impl Clone for VkPipelineCacheCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSpecializationMapEntry {
    pub constantID: u32,
    pub offset: u32,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_VkSpecializationMapEntry() {
    assert_eq!(::std::mem::size_of::<VkSpecializationMapEntry>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( VkSpecializationMapEntry ) ));
    assert_eq! (::std::mem::align_of::<VkSpecializationMapEntry>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkSpecializationMapEntry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationMapEntry ) ) . constantID
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSpecializationMapEntry ) , "::" , stringify ! ( constantID )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationMapEntry ) ) . offset as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSpecializationMapEntry ) , "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationMapEntry ) ) . size as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkSpecializationMapEntry ) , "::" , stringify ! ( size ) ));
}
impl Clone for VkSpecializationMapEntry {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkSpecializationInfo {
    pub mapEntryCount: u32,
    pub pMapEntries: *const VkSpecializationMapEntry,
    pub dataSize: usize,
    pub pData: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_VkSpecializationInfo() {
    assert_eq!(::std::mem::size_of::<VkSpecializationInfo>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( VkSpecializationInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkSpecializationInfo>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( VkSpecializationInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationInfo ) ) . mapEntryCount
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSpecializationInfo )
                , "::" , stringify ! ( mapEntryCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationInfo ) ) . pMapEntries as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSpecializationInfo )
                , "::" , stringify ! ( pMapEntries ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationInfo ) ) . dataSize as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSpecializationInfo )
                , "::" , stringify ! ( dataSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkSpecializationInfo ) ) . pData as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkSpecializationInfo )
                , "::" , stringify ! ( pData ) ));
}
impl Clone for VkSpecializationInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineShaderStageCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineShaderStageCreateFlags,
    pub stage: VkShaderStageFlagBits,
    pub module: VkShaderModule,
    pub pName: *const ::std::os::raw::c_char,
    pub pSpecializationInfo: *const VkSpecializationInfo,
}
#[test]
fn bindgen_test_layout_VkPipelineShaderStageCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineShaderStageCreateInfo>() ,
               48usize , concat ! (
               "Size of: " , stringify ! ( VkPipelineShaderStageCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkPipelineShaderStageCreateInfo>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineShaderStageCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! ( sType
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! ( pNext
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! ( flags
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                stage as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! ( stage
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                module as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! (
                module ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                pName as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! ( pName
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineShaderStageCreateInfo ) ) .
                pSpecializationInfo as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineShaderStageCreateInfo ) , "::" , stringify ! (
                pSpecializationInfo ) ));
}
impl Clone for VkPipelineShaderStageCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkVertexInputBindingDescription {
    pub binding: u32,
    pub stride: u32,
    pub inputRate: VkVertexInputRate,
}
#[test]
fn bindgen_test_layout_VkVertexInputBindingDescription() {
    assert_eq!(::std::mem::size_of::<VkVertexInputBindingDescription>() ,
               12usize , concat ! (
               "Size of: " , stringify ! ( VkVertexInputBindingDescription )
               ));
    assert_eq! (::std::mem::align_of::<VkVertexInputBindingDescription>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                VkVertexInputBindingDescription ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputBindingDescription ) ) .
                binding as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputBindingDescription ) , "::" , stringify ! (
                binding ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputBindingDescription ) ) .
                stride as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputBindingDescription ) , "::" , stringify ! (
                stride ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputBindingDescription ) ) .
                inputRate as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputBindingDescription ) , "::" , stringify ! (
                inputRate ) ));
}
impl Clone for VkVertexInputBindingDescription {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkVertexInputAttributeDescription {
    pub location: u32,
    pub binding: u32,
    pub format: VkFormat,
    pub offset: u32,
}
#[test]
fn bindgen_test_layout_VkVertexInputAttributeDescription() {
    assert_eq!(::std::mem::size_of::<VkVertexInputAttributeDescription>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( VkVertexInputAttributeDescription )
               ));
    assert_eq! (::std::mem::align_of::<VkVertexInputAttributeDescription>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                VkVertexInputAttributeDescription ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputAttributeDescription ) ) .
                location as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputAttributeDescription ) , "::" , stringify ! (
                location ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputAttributeDescription ) ) .
                binding as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputAttributeDescription ) , "::" , stringify ! (
                binding ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputAttributeDescription ) ) .
                format as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputAttributeDescription ) , "::" , stringify ! (
                format ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkVertexInputAttributeDescription ) ) .
                offset as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkVertexInputAttributeDescription ) , "::" , stringify ! (
                offset ) ));
}
impl Clone for VkVertexInputAttributeDescription {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineVertexInputStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineVertexInputStateCreateFlags,
    pub vertexBindingDescriptionCount: u32,
    pub pVertexBindingDescriptions: *const VkVertexInputBindingDescription,
    pub vertexAttributeDescriptionCount: u32,
    pub pVertexAttributeDescriptions: *const VkVertexInputAttributeDescription,
}
#[test]
fn bindgen_test_layout_VkPipelineVertexInputStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineVertexInputStateCreateInfo>() ,
               48usize , concat ! (
               "Size of: " , stringify ! (
               VkPipelineVertexInputStateCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineVertexInputStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . vertexBindingDescriptionCount as * const _ as usize } ,
                20usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                vertexBindingDescriptionCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . pVertexBindingDescriptions as * const _ as usize } , 24usize
                , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                pVertexBindingDescriptions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . vertexAttributeDescriptionCount as * const _ as usize } ,
                32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                vertexAttributeDescriptionCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineVertexInputStateCreateInfo ) )
                . pVertexAttributeDescriptions as * const _ as usize } ,
                40usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineVertexInputStateCreateInfo ) , "::" , stringify ! (
                pVertexAttributeDescriptions ) ));
}
impl Clone for VkPipelineVertexInputStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineInputAssemblyStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineInputAssemblyStateCreateFlags,
    pub topology: VkPrimitiveTopology,
    pub primitiveRestartEnable: VkBool32,
}
#[test]
fn bindgen_test_layout_VkPipelineInputAssemblyStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineInputAssemblyStateCreateInfo>()
               , 32usize , concat ! (
               "Size of: " , stringify ! (
               VkPipelineInputAssemblyStateCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineInputAssemblyStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineInputAssemblyStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineInputAssemblyStateCreateInfo )
                ) . sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineInputAssemblyStateCreateInfo ) , "::" , stringify !
                ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineInputAssemblyStateCreateInfo )
                ) . pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineInputAssemblyStateCreateInfo ) , "::" , stringify !
                ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineInputAssemblyStateCreateInfo )
                ) . flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineInputAssemblyStateCreateInfo ) , "::" , stringify !
                ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineInputAssemblyStateCreateInfo )
                ) . topology as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineInputAssemblyStateCreateInfo ) , "::" , stringify !
                ( topology ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineInputAssemblyStateCreateInfo )
                ) . primitiveRestartEnable as * const _ as usize } , 24usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineInputAssemblyStateCreateInfo ) , "::" , stringify !
                ( primitiveRestartEnable ) ));
}
impl Clone for VkPipelineInputAssemblyStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineTessellationStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineTessellationStateCreateFlags,
    pub patchControlPoints: u32,
}
#[test]
fn bindgen_test_layout_VkPipelineTessellationStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineTessellationStateCreateInfo>()
               , 24usize , concat ! (
               "Size of: " , stringify ! (
               VkPipelineTessellationStateCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineTessellationStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineTessellationStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineTessellationStateCreateInfo ) )
                . sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineTessellationStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineTessellationStateCreateInfo ) )
                . pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineTessellationStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineTessellationStateCreateInfo ) )
                . flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineTessellationStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineTessellationStateCreateInfo ) )
                . patchControlPoints as * const _ as usize } , 20usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineTessellationStateCreateInfo ) , "::" , stringify ! (
                patchControlPoints ) ));
}
impl Clone for VkPipelineTessellationStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkViewport {
    pub x: f32,
    pub y: f32,
    pub width: f32,
    pub height: f32,
    pub minDepth: f32,
    pub maxDepth: f32,
}
#[test]
fn bindgen_test_layout_VkViewport() {
    assert_eq!(::std::mem::size_of::<VkViewport>() , 24usize , concat ! (
               "Size of: " , stringify ! ( VkViewport ) ));
    assert_eq! (::std::mem::align_of::<VkViewport>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkViewport ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkViewport ) ) . x as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkViewport ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkViewport ) ) . y as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkViewport ) , "::" ,
                stringify ! ( y ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkViewport ) ) . width as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkViewport ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkViewport ) ) . height as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( VkViewport ) , "::" ,
                stringify ! ( height ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkViewport ) ) . minDepth as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkViewport ) , "::" ,
                stringify ! ( minDepth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkViewport ) ) . maxDepth as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( VkViewport ) , "::" ,
                stringify ! ( maxDepth ) ));
}
impl Clone for VkViewport {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkOffset2D {
    pub x: i32,
    pub y: i32,
}
#[test]
fn bindgen_test_layout_VkOffset2D() {
    assert_eq!(::std::mem::size_of::<VkOffset2D>() , 8usize , concat ! (
               "Size of: " , stringify ! ( VkOffset2D ) ));
    assert_eq! (::std::mem::align_of::<VkOffset2D>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkOffset2D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkOffset2D ) ) . x as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkOffset2D ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkOffset2D ) ) . y as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkOffset2D ) , "::" ,
                stringify ! ( y ) ));
}
impl Clone for VkOffset2D {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkExtent2D {
    pub width: u32,
    pub height: u32,
}
#[test]
fn bindgen_test_layout_VkExtent2D() {
    assert_eq!(::std::mem::size_of::<VkExtent2D>() , 8usize , concat ! (
               "Size of: " , stringify ! ( VkExtent2D ) ));
    assert_eq! (::std::mem::align_of::<VkExtent2D>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkExtent2D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtent2D ) ) . width as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtent2D ) , "::" ,
                stringify ! ( width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkExtent2D ) ) . height as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkExtent2D ) , "::" ,
                stringify ! ( height ) ));
}
impl Clone for VkExtent2D {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkRect2D {
    pub offset: VkOffset2D,
    pub extent: VkExtent2D,
}
#[test]
fn bindgen_test_layout_VkRect2D() {
    assert_eq!(::std::mem::size_of::<VkRect2D>() , 16usize , concat ! (
               "Size of: " , stringify ! ( VkRect2D ) ));
    assert_eq! (::std::mem::align_of::<VkRect2D>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( VkRect2D ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkRect2D ) ) . offset as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkRect2D ) , "::" ,
                stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkRect2D ) ) . extent as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkRect2D ) , "::" ,
                stringify ! ( extent ) ));
}
impl Clone for VkRect2D {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineViewportStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineViewportStateCreateFlags,
    pub viewportCount: u32,
    pub pViewports: *const VkViewport,
    pub scissorCount: u32,
    pub pScissors: *const VkRect2D,
}
#[test]
fn bindgen_test_layout_VkPipelineViewportStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineViewportStateCreateInfo>() ,
               48usize , concat ! (
               "Size of: " , stringify ! ( VkPipelineViewportStateCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkPipelineViewportStateCreateInfo>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineViewportStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                viewportCount as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                viewportCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                pViewports as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                pViewports ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                scissorCount as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                scissorCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineViewportStateCreateInfo ) ) .
                pScissors as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineViewportStateCreateInfo ) , "::" , stringify ! (
                pScissors ) ));
}
impl Clone for VkPipelineViewportStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineRasterizationStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineRasterizationStateCreateFlags,
    pub depthClampEnable: VkBool32,
    pub rasterizerDiscardEnable: VkBool32,
    pub polygonMode: VkPolygonMode,
    pub cullMode: VkCullModeFlags,
    pub frontFace: VkFrontFace,
    pub depthBiasEnable: VkBool32,
    pub depthBiasConstantFactor: f32,
    pub depthBiasClamp: f32,
    pub depthBiasSlopeFactor: f32,
    pub lineWidth: f32,
}
#[test]
fn bindgen_test_layout_VkPipelineRasterizationStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineRasterizationStateCreateInfo>()
               , 64usize , concat ! (
               "Size of: " , stringify ! (
               VkPipelineRasterizationStateCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineRasterizationStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . depthClampEnable as * const _ as usize } , 20usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( depthClampEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . rasterizerDiscardEnable as * const _ as usize } , 24usize
                , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( rasterizerDiscardEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . polygonMode as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( polygonMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . cullMode as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( cullMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . frontFace as * const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( frontFace ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . depthBiasEnable as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( depthBiasEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . depthBiasConstantFactor as * const _ as usize } , 44usize
                , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( depthBiasConstantFactor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . depthBiasClamp as * const _ as usize } , 48usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( depthBiasClamp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . depthBiasSlopeFactor as * const _ as usize } , 52usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( depthBiasSlopeFactor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineRasterizationStateCreateInfo )
                ) . lineWidth as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineRasterizationStateCreateInfo ) , "::" , stringify !
                ( lineWidth ) ));
}
impl Clone for VkPipelineRasterizationStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineMultisampleStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineMultisampleStateCreateFlags,
    pub rasterizationSamples: VkSampleCountFlagBits,
    pub sampleShadingEnable: VkBool32,
    pub minSampleShading: f32,
    pub pSampleMask: *const VkSampleMask,
    pub alphaToCoverageEnable: VkBool32,
    pub alphaToOneEnable: VkBool32,
}
#[test]
fn bindgen_test_layout_VkPipelineMultisampleStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineMultisampleStateCreateInfo>() ,
               48usize , concat ! (
               "Size of: " , stringify ! (
               VkPipelineMultisampleStateCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineMultisampleStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . rasterizationSamples as * const _ as usize } , 20usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                rasterizationSamples ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . sampleShadingEnable as * const _ as usize } , 24usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                sampleShadingEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . minSampleShading as * const _ as usize } , 28usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                minSampleShading ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . pSampleMask as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                pSampleMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . alphaToCoverageEnable as * const _ as usize } , 40usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                alphaToCoverageEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineMultisampleStateCreateInfo ) )
                . alphaToOneEnable as * const _ as usize } , 44usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineMultisampleStateCreateInfo ) , "::" , stringify ! (
                alphaToOneEnable ) ));
}
impl Clone for VkPipelineMultisampleStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkStencilOpState {
    pub failOp: VkStencilOp,
    pub passOp: VkStencilOp,
    pub depthFailOp: VkStencilOp,
    pub compareOp: VkCompareOp,
    pub compareMask: u32,
    pub writeMask: u32,
    pub reference: u32,
}
#[test]
fn bindgen_test_layout_VkStencilOpState() {
    assert_eq!(::std::mem::size_of::<VkStencilOpState>() , 28usize , concat !
               ( "Size of: " , stringify ! ( VkStencilOpState ) ));
    assert_eq! (::std::mem::align_of::<VkStencilOpState>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( VkStencilOpState ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . failOp as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( failOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . passOp as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( passOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . depthFailOp as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( depthFailOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . compareOp as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( compareOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . compareMask as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( compareMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . writeMask as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( writeMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkStencilOpState ) ) . reference as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( VkStencilOpState ) ,
                "::" , stringify ! ( reference ) ));
}
impl Clone for VkStencilOpState {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineDepthStencilStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineDepthStencilStateCreateFlags,
    pub depthTestEnable: VkBool32,
    pub depthWriteEnable: VkBool32,
    pub depthCompareOp: VkCompareOp,
    pub depthBoundsTestEnable: VkBool32,
    pub stencilTestEnable: VkBool32,
    pub front: VkStencilOpState,
    pub back: VkStencilOpState,
    pub minDepthBounds: f32,
    pub maxDepthBounds: f32,
}
#[test]
fn bindgen_test_layout_VkPipelineDepthStencilStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineDepthStencilStateCreateInfo>()
               , 104usize , concat ! (
               "Size of: " , stringify ! (
               VkPipelineDepthStencilStateCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineDepthStencilStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . depthTestEnable as * const _ as usize } , 20usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                depthTestEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . depthWriteEnable as * const _ as usize } , 24usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                depthWriteEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . depthCompareOp as * const _ as usize } , 28usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                depthCompareOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . depthBoundsTestEnable as * const _ as usize } , 32usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                depthBoundsTestEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . stencilTestEnable as * const _ as usize } , 36usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                stencilTestEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . front as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                front ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . back as * const _ as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                back ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . minDepthBounds as * const _ as usize } , 96usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                minDepthBounds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDepthStencilStateCreateInfo ) )
                . maxDepthBounds as * const _ as usize } , 100usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPipelineDepthStencilStateCreateInfo ) , "::" , stringify ! (
                maxDepthBounds ) ));
}
impl Clone for VkPipelineDepthStencilStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineColorBlendAttachmentState {
    pub blendEnable: VkBool32,
    pub srcColorBlendFactor: VkBlendFactor,
    pub dstColorBlendFactor: VkBlendFactor,
    pub colorBlendOp: VkBlendOp,
    pub srcAlphaBlendFactor: VkBlendFactor,
    pub dstAlphaBlendFactor: VkBlendFactor,
    pub alphaBlendOp: VkBlendOp,
    pub colorWriteMask: VkColorComponentFlags,
}
#[test]
fn bindgen_test_layout_VkPipelineColorBlendAttachmentState() {
    assert_eq!(::std::mem::size_of::<VkPipelineColorBlendAttachmentState>() ,
               32usize , concat ! (
               "Size of: " , stringify ! ( VkPipelineColorBlendAttachmentState
               ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineColorBlendAttachmentState>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineColorBlendAttachmentState ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                blendEnable as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                blendEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                srcColorBlendFactor as * const _ as usize } , 4usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                srcColorBlendFactor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                dstColorBlendFactor as * const _ as usize } , 8usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                dstColorBlendFactor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                colorBlendOp as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                colorBlendOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                srcAlphaBlendFactor as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                srcAlphaBlendFactor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                dstAlphaBlendFactor as * const _ as usize } , 20usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                dstAlphaBlendFactor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                alphaBlendOp as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                alphaBlendOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendAttachmentState ) ) .
                colorWriteMask as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendAttachmentState ) , "::" , stringify ! (
                colorWriteMask ) ));
}
impl Clone for VkPipelineColorBlendAttachmentState {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineColorBlendStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineColorBlendStateCreateFlags,
    pub logicOpEnable: VkBool32,
    pub logicOp: VkLogicOp,
    pub attachmentCount: u32,
    pub pAttachments: *const VkPipelineColorBlendAttachmentState,
    pub blendConstants: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_VkPipelineColorBlendStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineColorBlendStateCreateInfo>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( VkPipelineColorBlendStateCreateInfo
               ) ));
    assert_eq! (::std::mem::align_of::<VkPipelineColorBlendStateCreateInfo>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                logicOpEnable as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                logicOpEnable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                logicOp as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                logicOp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                attachmentCount as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                attachmentCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                pAttachments as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                pAttachments ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineColorBlendStateCreateInfo ) ) .
                blendConstants as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineColorBlendStateCreateInfo ) , "::" , stringify ! (
                blendConstants ) ));
}
impl Clone for VkPipelineColorBlendStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkPipelineDynamicStateCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineDynamicStateCreateFlags,
    pub dynamicStateCount: u32,
    pub pDynamicStates: *const VkDynamicState,
}
#[test]
fn bindgen_test_layout_VkPipelineDynamicStateCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkPipelineDynamicStateCreateInfo>() ,
               32usize , concat ! (
               "Size of: " , stringify ! ( VkPipelineDynamicStateCreateInfo )
               ));
    assert_eq! (::std::mem::align_of::<VkPipelineDynamicStateCreateInfo>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                VkPipelineDynamicStateCreateInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDynamicStateCreateInfo ) ) .
                sType as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDynamicStateCreateInfo ) , "::" , stringify ! (
                sType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDynamicStateCreateInfo ) ) .
                pNext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDynamicStateCreateInfo ) , "::" , stringify ! (
                pNext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDynamicStateCreateInfo ) ) .
                flags as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDynamicStateCreateInfo ) , "::" , stringify ! (
                flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDynamicStateCreateInfo ) ) .
                dynamicStateCount as * const _ as usize } , 20usize , concat !
                (
                "Alignment of field: " , stringify ! (
                VkPipelineDynamicStateCreateInfo ) , "::" , stringify ! (
                dynamicStateCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkPipelineDynamicStateCreateInfo ) ) .
                pDynamicStates as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkPipelineDynamicStateCreateInfo ) , "::" , stringify ! (
                pDynamicStates ) ));
}
impl Clone for VkPipelineDynamicStateCreateInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct VkGraphicsPipelineCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkPipelineCreateFlags,
    pub stageCount: u32,
    pub pStages: *const VkPipelineShaderStageCreateInfo,
    pub pVertexInputState: *const VkPipelineVertexInputStateCreateInfo,
    pub pInputAssemblyState: *const VkPipelineInputAssemblyStateCreateInfo,
    pub pTessellationState: *const VkPipelineTessellationStateCreateInfo,
    pub pViewportState: *const VkPipelineViewportStateCreateInfo,
    pub pRasterizationState: *const VkPipelineRasterizationStateCreateInfo,
    pub pMultisampleState: *const VkPipelineMultisampleStateCreateInfo,
    pub pDepthStencilState: *const VkPipelineDepthStencilStateCreateInfo,
    pub pColorBlendState: *const VkPipelineColorBlendStateCreateInfo,
    pub pDynamicState: *const VkPipelineDynamicStateCreateInfo,
    pub layout: VkPipelineLayout,
    pub renderPass: VkRenderPass,
    pub subpass: u32,
    pub basePipelineHandle: VkPipeline,
    pub basePipelineIndex: i32,
}
#[test]
fn bindgen_test_layout_VkGraphicsPipelineCreateInfo() {
    assert_eq!(::std::mem::size_of::<VkGraphicsPipelineCreateInfo>() ,
               144usize , concat ! (
               "Size of: " , stringify ! ( VkGraphicsPipelineCreateInfo ) ));
    assert_eq! (::std::mem::align_of::<VkGraphicsPipelineCreateInfo>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( VkGraphicsPipelineCreateInfo )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const VkGraphicsPipelineCreateInfo ) ) . sType
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                VkGraphicsPipelineCreateInfo ) , "::" , stringify ! ( sType )
